; ModuleID = '/home/chenql/code/EHTestDir/EHTest_Release_1.1/android-3.10/nfc/pn548_hwadapter.c'
source_filename = "/home/chenql/code/EHTestDir/EHTest_Release_1.1/android-3.10/nfc/pn548_hwadapter.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64--linux-android"

%struct.kernel_symbol = type { i64, i8* }
%struct.pn548_dev = type { %struct.__wait_queue_head, %struct.mutex, %struct.i2c_client*, %struct.miscdevice, i32, i32, i32, %struct.clk*, %struct.clk*, i8, [3 x i8], %struct.spinlock }
%struct.__wait_queue_head = type { %struct.spinlock, %struct.list_head }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.mutex = type { %struct.atomic_t, %struct.spinlock, %struct.list_head, %struct.task_struct*, i8* }
%struct.atomic_t = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "__kstrtab_pn548_get_hw_revision", scope: !2, file: !3, line: 26, type: !95, isLocal: true, isDefinition: true, align: 8)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !56)
!3 = !DIFile(filename: "/home/chenql/code/EHTestDir/EHTest_Release_1.1/android-3.10/nfc/pn548_hwadapter.c", directory: "/data/android/android-7.0/kernel/msm")
!4 = !{!5, !12, !18, !24, !31, !37, !42, !50}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "module_state", file: !6, line: 202, size: 32, elements: !7)
!6 = !DIFile(filename: "include/linux/module.h", directory: "/data/android/android-7.0/kernel/msm")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "MODULE_STATE_LIVE", value: 0)
!9 = !DIEnumerator(name: "MODULE_STATE_COMING", value: 1)
!10 = !DIEnumerator(name: "MODULE_STATE_GOING", value: 2)
!11 = !DIEnumerator(name: "MODULE_STATE_UNFORMED", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !13, line: 27, size: 32, elements: !14)
!13 = !DIFile(filename: "include/linux/kobject_ns.h", directory: "/data/android/android-7.0/kernel/msm")
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0)
!16 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1)
!17 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quota_type", file: !19, line: 53, size: 32, elements: !20)
!19 = !DIFile(filename: "include/linux/quota.h", directory: "/data/android/android-7.0/kernel/msm")
!20 = !{!21, !22, !23}
!21 = !DIEnumerator(name: "USRQUOTA", value: 0)
!22 = !DIEnumerator(name: "GRPQUOTA", value: 1)
!23 = !DIEnumerator(name: "PRJQUOTA", value: 2)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !25, line: 6, size: 32, elements: !26)
!25 = !DIFile(filename: "include/linux/pid.h", directory: "/data/android/android-7.0/kernel/msm")
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "PIDTYPE_PID", value: 0)
!28 = !DIEnumerator(name: "PIDTYPE_PGID", value: 1)
!29 = !DIEnumerator(name: "PIDTYPE_SID", value: 2)
!30 = !DIEnumerator(name: "PIDTYPE_MAX", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "migrate_mode", file: !32, line: 10, size: 32, elements: !33)
!32 = !DIFile(filename: "include/linux/migrate_mode.h", directory: "/data/android/android-7.0/kernel/msm")
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "MIGRATE_ASYNC", value: 0)
!35 = !DIEnumerator(name: "MIGRATE_SYNC_LIGHT", value: 1)
!36 = !DIEnumerator(name: "MIGRATE_SYNC", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !38, line: 44, size: 32, elements: !39)
!38 = !DIFile(filename: "include/linux/hrtimer.h", directory: "/data/android/android-7.0/kernel/msm")
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0)
!41 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !43, line: 492, size: 32, elements: !44)
!43 = !DIFile(filename: "include/linux/pm.h", directory: "/data/android/android-7.0/kernel/msm")
!44 = !{!45, !46, !47, !48, !49}
!45 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0)
!46 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1)
!47 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2)
!48 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3)
!49 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !43, line: 470, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "RPM_ACTIVE", value: 0)
!53 = !DIEnumerator(name: "RPM_RESUMING", value: 1)
!54 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2)
!55 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3)
!56 = !{!57, !69, !71, !73, !75, !77, !0, !79, !84, !86, !88, !90}
!57 = !DIGlobalVariableExpression(var: !58)
!58 = distinct !DIGlobalVariable(name: "__ksymtab_pn548_get_hw_revision", scope: !2, file: !3, line: 26, type: !59, isLocal: true, isDefinition: true)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_symbol", file: !61, line: 26, size: 128, elements: !62)
!61 = !DIFile(filename: "include/linux/export.h", directory: "/data/android/android-7.0/kernel/msm")
!62 = !{!63, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !60, file: !61, line: 28, baseType: !64, size: 64)
!64 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !60, file: !61, line: 29, baseType: !66, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!69 = !DIGlobalVariableExpression(var: !70)
!70 = distinct !DIGlobalVariable(name: "__ksymtab_pn548_get_irq_pin", scope: !2, file: !3, line: 32, type: !59, isLocal: true, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72)
!72 = distinct !DIGlobalVariable(name: "__ksymtab_pn548_gpio_to_irq", scope: !2, file: !3, line: 38, type: !59, isLocal: true, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74)
!74 = distinct !DIGlobalVariable(name: "__ksymtab_pn548_gpio_enable", scope: !2, file: !3, line: 44, type: !59, isLocal: true, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76)
!76 = distinct !DIGlobalVariable(name: "__ksymtab_pn548_shutdown_cb", scope: !2, file: !3, line: 50, type: !59, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78)
!78 = distinct !DIGlobalVariable(name: "__ksymtab_pn548_parse_dt", scope: !2, file: !3, line: 63, type: !59, isLocal: true, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80)
!80 = distinct !DIGlobalVariable(name: "__kstrtab_pn548_get_irq_pin", scope: !2, file: !3, line: 32, type: !81, isLocal: true, isDefinition: true, align: 8)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 144, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 18)
!84 = !DIGlobalVariableExpression(var: !85)
!85 = distinct !DIGlobalVariable(name: "__kstrtab_pn548_gpio_to_irq", scope: !2, file: !3, line: 38, type: !81, isLocal: true, isDefinition: true, align: 8)
!86 = !DIGlobalVariableExpression(var: !87)
!87 = distinct !DIGlobalVariable(name: "__kstrtab_pn548_gpio_enable", scope: !2, file: !3, line: 44, type: !81, isLocal: true, isDefinition: true, align: 8)
!88 = !DIGlobalVariableExpression(var: !89)
!89 = distinct !DIGlobalVariable(name: "__kstrtab_pn548_shutdown_cb", scope: !2, file: !3, line: 50, type: !81, isLocal: true, isDefinition: true, align: 8)
!90 = !DIGlobalVariableExpression(var: !91)
!91 = distinct !DIGlobalVariable(name: "__kstrtab_pn548_parse_dt", scope: !2, file: !3, line: 63, type: !92, isLocal: true, isDefinition: true, align: 8)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 120, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 15)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 176, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 22)
!98 = !{i32 2, !"Dwarf Version", i32 4}
!99 = !{i32 2, !"Debug Info Version", i32 3}
!100 = !{i32 1, !"wchar_size", i32 4}
!101 = !{!"clang version 5.0.0 (tags/RELEASE_500/final)"}
!102 = distinct !DISubprogram(name: "pn548_get_hw_revision", scope: !3, file: !3, line: 22, type: !103, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !106)
!103 = !DISubroutineType(types: !104)
!104 = !{!105}
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !{}
!107 = !DILocation(line: 24, column: 2, scope: !102)
!108 = distinct !DISubprogram(name: "pn548_get_irq_pin", scope: !3, file: !3, line: 28, type: !109, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !3449)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !112}
!111 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pn548_dev", file: !114, line: 61, size: 1472, elements: !115)
!114 = !DIFile(filename: "include/linux/nfc/pn548.h", directory: "/data/android/android-7.0/kernel/msm")
!115 = !{!116, !149, !2845, !3428, !3440, !3441, !3442, !3443, !3446, !3447, !3448}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "read_wq", scope: !113, file: !114, line: 62, baseType: !117, size: 192)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !118, line: 37, baseType: !119)
!118 = !DIFile(filename: "include/linux/wait.h", directory: "/data/android/android-7.0/kernel/msm")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__wait_queue_head", file: !118, line: 33, size: 192, elements: !120)
!120 = !{!121, !142}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !119, file: !118, line: 34, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !123, line: 76, baseType: !124)
!123 = !DIFile(filename: "include/linux/spinlock_types.h", directory: "/data/android/android-7.0/kernel/msm")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !123, line: 64, size: 32, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !123, line: 65, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !123, line: 65, size: 32, elements: !128)
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !127, file: !123, line: 66, baseType: !130, size: 32)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !123, line: 20, size: 32, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !130, file: !123, line: 21, baseType: !133, size: 32, align: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !134, line: 33, baseType: !135)
!134 = !DIFile(filename: "/data/android/android-7.0/kernel/msm/arch/arm64/include/asm/spinlock_types.h", directory: "/data/android/android-7.0/kernel/msm")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 25, size: 32, align: 32, elements: !136)
!136 = !{!137, !141}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !135, file: !134, line: 30, baseType: !138, size: 16)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !139, line: 19, baseType: !140)
!139 = !DIFile(filename: "include/asm-generic/int-ll64.h", directory: "/data/android/android-7.0/kernel/msm")
!140 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !134, line: 31, baseType: !138, size: 16, offset: 16)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !119, file: !118, line: 35, baseType: !143, size: 128, offset: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !144, line: 185, size: 128, elements: !145)
!144 = !DIFile(filename: "include/linux/types.h", directory: "/data/android/android-7.0/kernel/msm")
!145 = !{!146, !148}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !143, file: !144, line: 186, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !143, file: !144, line: 186, baseType: !147, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "read_mutex", scope: !113, file: !114, line: 63, baseType: !150, size: 320, offset: 192)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !151, line: 48, size: 320, elements: !152)
!151 = !DIFile(filename: "include/linux/mutex.h", directory: "/data/android/android-7.0/kernel/msm")
!152 = !{!153, !158, !159, !160, !2844}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !150, file: !151, line: 50, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !144, line: 177, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 175, size: 32, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !155, file: !144, line: 176, baseType: !105, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !150, file: !151, line: 51, baseType: !122, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !150, file: !151, line: 52, baseType: !143, size: 128, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !150, file: !151, line: 54, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !163, line: 1169, size: 22016, elements: !164)
!163 = !DIFile(filename: "include/linux/sched.h", directory: "/data/android/android-7.0/kernel/msm")
!164 = !{!165, !168, !170, !171, !172, !173, !179, !180, !181, !182, !183, !184, !185, !189, !262, !276, !286, !287, !288, !291, !293, !294, !295, !296, !305, !306, !307, !308, !311, !324, !331, !332, !338, !2334, !2335, !2336, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2372, !2373, !2374, !2376, !2377, !2378, !2381, !2382, !2383, !2384, !2385, !2386, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2403, !2405, !2406, !2407, !2409, !2410, !2411, !2469, !2472, !2473, !2492, !2652, !2681, !2682, !2683, !2684, !2685, !2686, !2687, !2691, !2692, !2694, !2695, !2699, !2707, !2708, !2709, !2710, !2711, !2712, !2715, !2716, !2719, !2722, !2725, !2726, !2730, !2731, !2798, !2799, !2805, !2806, !2807, !2808, !2811, !2812, !2815, !2818, !2819, !2822, !2826, !2827, !2828, !2829, !2830, !2836, !2837, !2838, !2839, !2840, !2841, !2842, !2843}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !162, file: !163, line: 1170, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !167)
!167 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !162, file: !163, line: 1171, baseType: !169, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !162, file: !163, line: 1172, baseType: !154, size: 32, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !162, file: !163, line: 1173, baseType: !111, size: 32, offset: 160)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !162, file: !163, line: 1174, baseType: !111, size: 32, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "wake_entry", scope: !162, file: !163, line: 1177, baseType: !174, size: 64, offset: 256)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !175, line: 65, size: 64, elements: !176)
!175 = !DIFile(filename: "include/linux/llist.h", directory: "/data/android/android-7.0/kernel/msm")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !174, file: !175, line: 66, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "on_cpu", scope: !162, file: !163, line: 1178, baseType: !105, size: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !162, file: !163, line: 1180, baseType: !105, size: 32, offset: 352)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !162, file: !163, line: 1182, baseType: !105, size: 32, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !162, file: !163, line: 1182, baseType: !105, size: 32, offset: 416)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !162, file: !163, line: 1182, baseType: !105, size: 32, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !162, file: !163, line: 1183, baseType: !111, size: 32, offset: 480)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !162, file: !163, line: 1184, baseType: !186, size: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !163, line: 1184, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !162, file: !163, line: 1185, baseType: !190, size: 3072, offset: 576)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !163, line: 1086, size: 3072, elements: !191)
!191 = !{!192, !197, !205, !206, !207, !210, !211, !212, !213, !214, !246, !248, !251, !252}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !190, file: !163, line: 1087, baseType: !193, size: 128)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !163, line: 997, size: 128, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !193, file: !163, line: 998, baseType: !64, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !193, file: !163, line: 998, baseType: !64, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !190, file: !163, line: 1088, baseType: !198, size: 192, align: 64, offset: 128)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !199, line: 35, size: 192, align: 64, elements: !200)
!199 = !DIFile(filename: "include/linux/rbtree.h", directory: "/data/android/android-7.0/kernel/msm")
!200 = !{!201, !202, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !198, file: !199, line: 36, baseType: !64, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !198, file: !199, line: 37, baseType: !203, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !198, file: !199, line: 38, baseType: !203, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !190, file: !163, line: 1089, baseType: !143, size: 128, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !190, file: !163, line: 1090, baseType: !111, size: 32, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !190, file: !163, line: 1092, baseType: !208, size: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !139, line: 25, baseType: !209)
!209 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !190, file: !163, line: 1093, baseType: !208, size: 64, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !190, file: !163, line: 1094, baseType: !208, size: 64, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !190, file: !163, line: 1095, baseType: !208, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !190, file: !163, line: 1097, baseType: !208, size: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !190, file: !163, line: 1100, baseType: !215, size: 1728, offset: 832)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !163, line: 1017, size: 1728, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "wait_start", scope: !215, file: !163, line: 1018, baseType: !208, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "wait_max", scope: !215, file: !163, line: 1019, baseType: !208, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "wait_count", scope: !215, file: !163, line: 1020, baseType: !208, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "wait_sum", scope: !215, file: !163, line: 1021, baseType: !208, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_count", scope: !215, file: !163, line: 1022, baseType: !208, size: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_sum", scope: !215, file: !163, line: 1023, baseType: !208, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_start", scope: !215, file: !163, line: 1025, baseType: !208, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_max", scope: !215, file: !163, line: 1026, baseType: !208, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sum_sleep_runtime", scope: !215, file: !163, line: 1027, baseType: !226, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !139, line: 24, baseType: !227)
!227 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "block_start", scope: !215, file: !163, line: 1029, baseType: !208, size: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "block_max", scope: !215, file: !163, line: 1030, baseType: !208, size: 64, offset: 640)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "exec_max", scope: !215, file: !163, line: 1031, baseType: !208, size: 64, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "slice_max", scope: !215, file: !163, line: 1032, baseType: !208, size: 64, offset: 768)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations_cold", scope: !215, file: !163, line: 1034, baseType: !208, size: 64, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_affine", scope: !215, file: !163, line: 1035, baseType: !208, size: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_running", scope: !215, file: !163, line: 1036, baseType: !208, size: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_hot", scope: !215, file: !163, line: 1037, baseType: !208, size: 64, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "nr_forced_migrations", scope: !215, file: !163, line: 1038, baseType: !208, size: 64, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups", scope: !215, file: !163, line: 1040, baseType: !208, size: 64, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_sync", scope: !215, file: !163, line: 1041, baseType: !208, size: 64, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_migrate", scope: !215, file: !163, line: 1042, baseType: !208, size: 64, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_local", scope: !215, file: !163, line: 1043, baseType: !208, size: 64, offset: 1344)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_remote", scope: !215, file: !163, line: 1044, baseType: !208, size: 64, offset: 1408)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine", scope: !215, file: !163, line: 1045, baseType: !208, size: 64, offset: 1472)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine_attempts", scope: !215, file: !163, line: 1046, baseType: !208, size: 64, offset: 1536)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_passive", scope: !215, file: !163, line: 1047, baseType: !208, size: 64, offset: 1600)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_idle", scope: !215, file: !163, line: 1048, baseType: !208, size: 64, offset: 1664)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !190, file: !163, line: 1104, baseType: !247, size: 64, offset: 2560)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cfs_rq", scope: !190, file: !163, line: 1106, baseType: !249, size: 64, offset: 2624)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "cfs_rq", file: !163, line: 186, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "my_q", scope: !190, file: !163, line: 1108, baseType: !249, size: 64, offset: 2688)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "avg", scope: !190, file: !163, line: 1118, baseType: !253, size: 320, offset: 2752)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_avg", file: !163, line: 1001, size: 320, elements: !254)
!254 = !{!255, !257, !258, !259, !260, !261}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "runnable_avg_sum", scope: !253, file: !163, line: 1007, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !139, line: 22, baseType: !111)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "runnable_avg_period", scope: !253, file: !163, line: 1007, baseType: !256, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "runnable_avg_sum_scaled", scope: !253, file: !163, line: 1009, baseType: !256, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "last_runnable_update", scope: !253, file: !163, line: 1011, baseType: !208, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "decay_count", scope: !253, file: !163, line: 1012, baseType: !226, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "load_avg_contrib", scope: !253, file: !163, line: 1013, baseType: !64, size: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !162, file: !163, line: 1186, baseType: !263, size: 576, offset: 3648)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !163, line: 1122, size: 576, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !271, !272, !275}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !263, file: !163, line: 1123, baseType: !143, size: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !263, file: !163, line: 1124, baseType: !64, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !263, file: !163, line: 1125, baseType: !64, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !263, file: !163, line: 1126, baseType: !111, size: 32, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !263, file: !163, line: 1128, baseType: !270, size: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !263, file: !163, line: 1130, baseType: !270, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rq", scope: !263, file: !163, line: 1132, baseType: !273, size: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_rq", file: !163, line: 1132, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "my_q", scope: !263, file: !163, line: 1134, baseType: !273, size: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ravg", scope: !162, file: !163, line: 1188, baseType: !277, size: 320, offset: 4224)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ravg", file: !163, line: 1055, size: 320, elements: !278)
!278 = !{!279, !280, !281, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mark_start", scope: !277, file: !163, line: 1078, baseType: !208, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !277, file: !163, line: 1079, baseType: !256, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "demand", scope: !277, file: !163, line: 1079, baseType: !256, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sum_history", scope: !277, file: !163, line: 1080, baseType: !283, size: 160, offset: 128)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 160, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 5)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "init_load_pct", scope: !162, file: !163, line: 1193, baseType: !256, size: 32, offset: 4544)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "run_start", scope: !162, file: !163, line: 1194, baseType: !208, size: 64, offset: 4608)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sched_task_group", scope: !162, file: !163, line: 1197, baseType: !289, size: 64, offset: 4672)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "task_group", file: !163, line: 187, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_counter", scope: !162, file: !163, line: 1213, baseType: !292, size: 8, offset: 4736)
!292 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "btrace_seq", scope: !162, file: !163, line: 1215, baseType: !111, size: 32, offset: 4768)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !162, file: !163, line: 1218, baseType: !111, size: 32, offset: 4800)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !162, file: !163, line: 1219, baseType: !105, size: 32, offset: 4832)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_allowed", scope: !162, file: !163, line: 1220, baseType: !297, size: 64, offset: 4864)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !298, line: 14, baseType: !299)
!298 = !DIFile(filename: "include/linux/cpumask.h", directory: "/data/android/android-7.0/kernel/msm")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !298, line: 14, size: 64, elements: !300)
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !299, file: !298, line: 14, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 64, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 1)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_read_lock_nesting", scope: !162, file: !163, line: 1223, baseType: !105, size: 32, offset: 4928)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_read_unlock_special", scope: !162, file: !163, line: 1224, baseType: !68, size: 8, offset: 4960)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_node_entry", scope: !162, file: !163, line: 1225, baseType: !143, size: 128, offset: 4992)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_blocked_node", scope: !162, file: !163, line: 1228, baseType: !309, size: 64, offset: 5120)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "rcu_node", file: !163, line: 1139, flags: DIFlagFwdDecl)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_boost_mutex", scope: !162, file: !163, line: 1231, baseType: !312, size: 64, offset: 5184)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex", file: !314, line: 28, size: 256, elements: !315)
!314 = !DIFile(filename: "include/linux/rtmutex.h", directory: "/data/android/android-7.0/kernel/msm")
!315 = !{!316, !318, !323}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !313, file: !314, line: 29, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !123, line: 32, baseType: !130)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !313, file: !314, line: 30, baseType: !319, size: 128, offset: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plist_head", file: !320, line: 81, size: 128, elements: !321)
!320 = !DIFile(filename: "include/linux/plist.h", directory: "/data/android/android-7.0/kernel/msm")
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "node_list", scope: !319, file: !320, line: 82, baseType: !143, size: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !313, file: !314, line: 31, baseType: !161, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !162, file: !163, line: 1235, baseType: !325, size: 256, offset: 5248)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !163, line: 772, size: 256, elements: !326)
!326 = !{!327, !328, !329, !330}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pcount", scope: !325, file: !163, line: 774, baseType: !64, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "run_delay", scope: !325, file: !163, line: 775, baseType: !209, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "last_arrival", scope: !325, file: !163, line: 778, baseType: !209, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "last_queued", scope: !325, file: !163, line: 779, baseType: !209, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !162, file: !163, line: 1238, baseType: !143, size: 128, offset: 5504)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pushable_tasks", scope: !162, file: !163, line: 1240, baseType: !333, size: 320, offset: 5632)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plist_node", file: !320, line: 85, size: 320, elements: !334)
!334 = !{!335, !336, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !333, file: !320, line: 86, baseType: !105, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prio_list", scope: !333, file: !320, line: 87, baseType: !143, size: 128, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "node_list", scope: !333, file: !320, line: 88, baseType: !143, size: 128, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !162, file: !163, line: 1243, baseType: !339, size: 64, offset: 5952)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !341, line: 340, size: 5952, elements: !342)
!341 = !DIFile(filename: "include/linux/mm_types.h", directory: "/data/android/android-7.0/kernel/msm")
!342 = !{!343, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2290, !2295, !2298, !2301, !2309, !2310, !2327, !2328, !2329, !2330, !2331}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !340, file: !341, line: 341, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !341, line: 238, size: 1408, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !358, !359, !369, !370, !373, !2245, !2246, !2247}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !345, file: !341, line: 241, baseType: !64, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !345, file: !341, line: 242, baseType: !64, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !345, file: !341, line: 246, baseType: !344, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !345, file: !341, line: 246, baseType: !344, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !345, file: !341, line: 248, baseType: !198, size: 192, align: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !345, file: !341, line: 256, baseType: !64, size: 64, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !345, file: !341, line: 260, baseType: !339, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "vm_page_prot", scope: !345, file: !341, line: 261, baseType: !355, size: 64, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprot_t", file: !356, line: 52, baseType: !357)
!356 = !DIFile(filename: "/data/android/android-7.0/kernel/msm/arch/arm64/include/asm/pgtable-3level-types.h", directory: "/data/android/android-7.0/kernel/msm")
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "pteval_t", file: !356, line: 21, baseType: !208)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "vm_flags", scope: !345, file: !341, line: 262, baseType: !64, size: 64, offset: 640)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !345, file: !341, line: 280, baseType: !360, size: 256, offset: 704)
!360 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !345, file: !341, line: 273, size: 256, elements: !361)
!361 = !{!362, !367, !368}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "linear", scope: !360, file: !341, line: 277, baseType: !363, size: 256)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !360, file: !341, line: 274, size: 256, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !363, file: !341, line: 275, baseType: !198, size: 192, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_last", scope: !363, file: !341, line: 276, baseType: !64, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "nonlinear", scope: !360, file: !341, line: 278, baseType: !143, size: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "anon_name", scope: !360, file: !341, line: 279, baseType: !66, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma_chain", scope: !345, file: !341, line: 288, baseType: !143, size: 128, offset: 960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma", scope: !345, file: !341, line: 290, baseType: !371, size: 64, offset: 1088)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "anon_vma", file: !341, line: 290, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !345, file: !341, line: 293, baseType: !374, size: 64, offset: 1152)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !377, line: 215, size: 384, elements: !378)
!377 = !DIFile(filename: "include/linux/mm.h", directory: "/data/android/android-7.0/kernel/msm")
!378 = !{!379, !383, !384, !2236, !2237, !2241}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !376, file: !377, line: 216, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !344}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !376, file: !377, line: 217, baseType: !380, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "fault", scope: !376, file: !377, line: 218, baseType: !385, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!105, !344, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_fault", file: !377, line: 198, size: 256, elements: !390)
!390 = !{!391, !392, !393, !394}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !389, file: !377, line: 199, baseType: !111, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pgoff", scope: !389, file: !377, line: 200, baseType: !64, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_address", scope: !389, file: !377, line: 201, baseType: !169, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !389, file: !377, line: 203, baseType: !395, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !341, line: 42, size: 512, elements: !397)
!397 = !{!398, !399, !2186, !2214, !2228, !2235}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !396, file: !341, line: 44, baseType: !64, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !396, file: !341, line: 46, baseType: !400, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !402, line: 413, size: 1344, align: 64, elements: !403)
!402 = !DIFile(filename: "include/linux/fs.h", directory: "/data/android/android-7.0/kernel/msm")
!403 = !{!404, !2061, !2070, !2071, !2072, !2076, !2077, !2078, !2079, !2080, !2181, !2182, !2183, !2184, !2185}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !401, file: !402, line: 414, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !402, line: 528, size: 4416, elements: !407)
!407 = !{!408, !410, !411, !417, !421, !422, !425, !426, !2009, !2010, !2011, !2012, !2013, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2057, !2058, !2059, !2060}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !406, file: !402, line: 529, baseType: !409, size: 16)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !144, line: 18, baseType: !140)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !406, file: !402, line: 530, baseType: !140, size: 16, offset: 16)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !406, file: !402, line: 531, baseType: !412, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !413, line: 46, baseType: !414)
!413 = !DIFile(filename: "include/linux/uidgid.h", directory: "/data/android/android-7.0/kernel/msm")
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !144, line: 31, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !416, line: 48, baseType: !111)
!416 = !DIFile(filename: "/data/android/android-7.0/kernel/msm/include/uapi/asm-generic/posix_types.h", directory: "/data/android/android-7.0/kernel/msm")
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !406, file: !402, line: 532, baseType: !418, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !413, line: 47, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !144, line: 32, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !416, line: 49, baseType: !111)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !406, file: !402, line: 533, baseType: !111, size: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_acl", scope: !406, file: !402, line: 536, baseType: !423, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !402, line: 516, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_default_acl", scope: !406, file: !402, line: 537, baseType: !423, size: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !406, file: !402, line: 540, baseType: !427, size: 64, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !402, line: 1579, size: 1536, align: 512, elements: !430)
!430 = !{!431, !1401, !1407, !1411, !1415, !1419, !1423, !1427, !1431, !1435, !1439, !1443, !1444, !1448, !1452, !1940, !1961, !1965, !1969, !1973, !1977, !2000, !2005}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !429, file: !402, line: 1580, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!435, !405, !435, !111}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !437, line: 103, size: 1536, elements: !438)
!437 = !DIFile(filename: "include/linux/dcache.h", directory: "/data/android/android-7.0/kernel/msm")
!438 = !{!439, !440, !446, !454, !455, !470, !471, !475, !476, !477, !545, !1383, !1384, !1385, !1386, !1399, !1400}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !436, file: !437, line: 105, baseType: !111, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !436, file: !437, line: 106, baseType: !441, size: 32, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !442, line: 41, baseType: !443)
!442 = !DIFile(filename: "include/linux/seqlock.h", directory: "/data/android/android-7.0/kernel/msm")
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !442, line: 39, size: 32, elements: !444)
!444 = !{!445}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !443, file: !442, line: 40, baseType: !111, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !436, file: !437, line: 107, baseType: !447, size: 128, offset: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !448, line: 37, size: 128, elements: !449)
!448 = !DIFile(filename: "include/linux/list_bl.h", directory: "/data/android/android-7.0/kernel/msm")
!449 = !{!450, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !447, file: !448, line: 38, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !447, file: !448, line: 38, baseType: !453, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !436, file: !437, line: 108, baseType: !435, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !436, file: !437, line: 109, baseType: !456, size: 128, offset: 256)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !437, line: 42, size: 128, elements: !457)
!457 = !{!458, !467}
!458 = !DIDerivedType(tag: DW_TAG_member, scope: !456, file: !437, line: 43, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !456, file: !437, line: 43, size: 64, elements: !460)
!460 = !{!461, !466}
!461 = !DIDerivedType(tag: DW_TAG_member, scope: !459, file: !437, line: 44, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !459, file: !437, line: 44, size: 64, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !462, file: !437, line: 45, baseType: !256, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !462, file: !437, line: 45, baseType: !256, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !459, file: !437, line: 47, baseType: !208, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !456, file: !437, line: 49, baseType: !468, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !436, file: !437, line: 110, baseType: !405, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "d_iname", scope: !436, file: !437, line: 112, baseType: !472, size: 256, offset: 448)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 256, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "d_count", scope: !436, file: !437, line: 115, baseType: !111, size: 32, offset: 704)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "d_lock", scope: !436, file: !437, line: 116, baseType: !122, size: 32, offset: 736)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "d_op", scope: !436, file: !437, line: 117, baseType: !478, size: 64, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry_operations", file: !437, line: 146, size: 1024, align: 512, elements: !481)
!481 = !{!482, !486, !487, !496, !502, !506, !510, !511, !515, !520, !533, !539}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "d_revalidate", scope: !480, file: !437, line: 147, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!105, !435, !111}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "d_weak_revalidate", scope: !480, file: !437, line: 148, baseType: !483, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !480, file: !437, line: 149, baseType: !488, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!105, !491, !493, !495}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "d_compare", scope: !480, file: !437, line: 151, baseType: !497, size: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!105, !491, !493, !491, !493, !111, !66, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "d_delete", scope: !480, file: !437, line: 154, baseType: !503, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!105, !491}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "d_release", scope: !480, file: !437, line: 155, baseType: !507, size: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !435}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "d_prune", scope: !480, file: !437, line: 156, baseType: !507, size: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "d_iput", scope: !480, file: !437, line: 157, baseType: !512, size: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !435, !405}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "d_dname", scope: !480, file: !437, line: 158, baseType: !516, size: 64, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!519, !435, !519, !105}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "d_automount", scope: !480, file: !437, line: 159, baseType: !521, size: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!524, !527}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !526, line: 33, flags: DIFlagFwdDecl)
!526 = !DIFile(filename: "include/linux/pid_namespace.h", directory: "/data/android/android-7.0/kernel/msm")
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !529, line: 7, size: 128, elements: !530)
!529 = !DIFile(filename: "include/linux/path.h", directory: "/data/android/android-7.0/kernel/msm")
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !528, file: !529, line: 8, baseType: !524, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !528, file: !529, line: 9, baseType: !435, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "d_manage", scope: !480, file: !437, line: 160, baseType: !534, size: 64, offset: 640)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!105, !435, !537}
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !144, line: 29, baseType: !538)
!538 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "d_canonical_path", scope: !480, file: !437, line: 161, baseType: !540, size: 64, offset: 704)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !543, !527}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "d_sb", scope: !436, file: !437, line: 118, baseType: !546, size: 64, offset: 832)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !402, line: 1248, size: 8192, elements: !548)
!548 = !{!549, !550, !555, !556, !557, !560, !936, !1040, !1107, !1201, !1205, !1206, !1207, !1208, !1215, !1216, !1217, !1218, !1223, !1224, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1267, !1270, !1273, !1274, !1318, !1335, !1337, !1342, !1343, !1344, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1376, !1377, !1378, !1382}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !547, file: !402, line: 1249, baseType: !143, size: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !547, file: !402, line: 1250, baseType: !551, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !144, line: 15, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !144, line: 12, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !554, line: 26, baseType: !111)
!554 = !DIFile(filename: "include/uapi/asm-generic/int-ll64.h", directory: "/data/android/android-7.0/kernel/msm")
!555 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !547, file: !402, line: 1251, baseType: !292, size: 8, offset: 160)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !547, file: !402, line: 1252, baseType: !64, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !547, file: !402, line: 1253, baseType: !558, size: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !144, line: 45, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !416, line: 87, baseType: !227)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !547, file: !402, line: 1254, baseType: !561, size: 64, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !402, line: 1835, size: 448, elements: !563)
!563 = !{!564, !565, !566, !570, !574, !913, !914, !924, !927, !928, !929, !933, !934, !935}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !562, file: !402, line: 1836, baseType: !66, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !562, file: !402, line: 1837, baseType: !105, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !562, file: !402, line: 1844, baseType: !567, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!435, !561, !105, !66, !169}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !562, file: !402, line: 1846, baseType: !571, size: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !546}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !562, file: !402, line: 1847, baseType: !575, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !6, line: 223, size: 3904, elements: !577)
!577 = !{!578, !579, !580, !584, !725, !751, !752, !753, !754, !756, !759, !760, !808, !809, !810, !811, !812, !813, !814, !815, !816, !823, !825, !826, !827, !828, !829, !830, !831, !832, !833, !836, !837, !838, !839, !848, !866, !867, !868, !869, !870, !871, !874, !877, !878, !879, !880, !881, !905, !906, !908, !912}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !576, file: !6, line: 225, baseType: !5, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !576, file: !6, line: 228, baseType: !143, size: 128, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !576, file: !6, line: 231, baseType: !581, size: 448, offset: 192)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 448, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 56)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mkobj", scope: !576, file: !6, line: 234, baseType: !585, size: 704, offset: 640)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_kobject", file: !6, line: 40, size: 704, elements: !586)
!586 = !{!587, !720, !721, !722}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !585, file: !6, line: 41, baseType: !588, size: 512)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !589, line: 60, size: 512, elements: !590)
!589 = !DIFile(filename: "include/linux/kobject.h", directory: "/data/android/android-7.0/kernel/msm")
!590 = !{!591, !592, !593, !595, !633, !707, !710, !715, !716, !717, !718, !719}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !588, file: !589, line: 61, baseType: !66, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !588, file: !589, line: 62, baseType: !143, size: 128, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !588, file: !589, line: 63, baseType: !594, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !588, file: !589, line: 64, baseType: !596, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !589, line: 159, size: 768, elements: !598)
!598 = !{!599, !600, !601, !602}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !597, file: !589, line: 160, baseType: !143, size: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !597, file: !589, line: 161, baseType: !122, size: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !597, file: !589, line: 162, baseType: !588, size: 512, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !597, file: !589, line: 163, baseType: !603, size: 64, offset: 704)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !589, line: 123, size: 192, elements: !606)
!606 = !{!607, !612, !617}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !605, file: !589, line: 124, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!105, !596, !594}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !605, file: !589, line: 125, baseType: !613, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!66, !596, !594}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !605, file: !589, line: 126, baseType: !618, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!105, !596, !594, !622}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !589, line: 116, size: 18496, elements: !624)
!624 = !{!625, !627, !628, !632}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !623, file: !589, line: 117, baseType: !626, size: 2048)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 2048, elements: !473)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !623, file: !589, line: 118, baseType: !105, size: 32, offset: 2048)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !623, file: !589, line: 119, baseType: !629, size: 16384, offset: 2080)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 16384, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 2048)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !623, file: !589, line: 120, baseType: !105, size: 32, offset: 18464)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !588, file: !589, line: 65, baseType: !634, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !589, line: 108, size: 320, elements: !636)
!636 = !{!637, !641, !674, !676, !703}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !635, file: !589, line: 109, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !594}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !635, file: !589, line: 110, baseType: !642, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !645, line: 124, size: 192, elements: !646)
!645 = !DIFile(filename: "include/linux/sysfs.h", directory: "/data/android/android-7.0/kernel/msm")
!646 = !{!647, !659, !666}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !644, file: !645, line: 125, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!651, !594, !654, !519}
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !144, line: 59, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !416, line: 72, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !416, line: 14, baseType: !167)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !645, line: 26, size: 128, elements: !656)
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !655, file: !645, line: 27, baseType: !66, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !655, file: !645, line: 28, baseType: !409, size: 16, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !644, file: !645, line: 126, baseType: !660, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!651, !594, !654, !66, !663}
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !144, line: 54, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !416, line: 71, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !416, line: 15, baseType: !64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !644, file: !645, line: 127, baseType: !667, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!670, !594, !672}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !655)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !635, file: !589, line: 111, baseType: !675, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !635, file: !589, line: 112, baseType: !677, size: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !594}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !13, line: 40, size: 320, elements: !683)
!683 = !{!684, !685, !689, !695, !699}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !682, file: !13, line: 41, baseType: !12, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !682, file: !13, line: 42, baseType: !686, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!169}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !682, file: !13, line: 43, baseType: !690, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!670, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !13, line: 20, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !682, file: !13, line: 44, baseType: !696, size: 64, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!670}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !682, file: !13, line: 45, baseType: !700, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !169}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !635, file: !589, line: 113, baseType: !704, size: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!670, !594}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !588, file: !589, line: 66, baseType: !708, size: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_dirent", file: !645, line: 130, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "kref", scope: !588, file: !589, line: 67, baseType: !711, size: 32, offset: 448)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !712, line: 24, size: 32, elements: !713)
!712 = !DIFile(filename: "include/linux/kref.h", directory: "/data/android/android-7.0/kernel/msm")
!713 = !{!714}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !711, file: !712, line: 25, baseType: !154, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "state_initialized", scope: !588, file: !589, line: 68, baseType: !111, size: 1, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_sysfs", scope: !588, file: !589, line: 69, baseType: !111, size: 1, offset: 481, flags: DIFlagBitField, extraData: i64 480)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "state_add_uevent_sent", scope: !588, file: !589, line: 70, baseType: !111, size: 1, offset: 482, flags: DIFlagBitField, extraData: i64 480)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "state_remove_uevent_sent", scope: !588, file: !589, line: 71, baseType: !111, size: 1, offset: 483, flags: DIFlagBitField, extraData: i64 480)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_suppress", scope: !588, file: !589, line: 72, baseType: !111, size: 1, offset: 484, flags: DIFlagBitField, extraData: i64 480)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !585, file: !6, line: 42, baseType: !575, size: 64, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "drivers_dir", scope: !585, file: !6, line: 43, baseType: !594, size: 64, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mp", scope: !585, file: !6, line: 44, baseType: !723, size: 64, offset: 640)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_param_attrs", file: !6, line: 44, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "modinfo_attrs", scope: !576, file: !6, line: 235, baseType: !726, size: 64, offset: 1344)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_attribute", file: !6, line: 47, size: 448, elements: !728)
!728 = !{!729, !730, !735, !739, !743, !747}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !727, file: !6, line: 48, baseType: !655, size: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !727, file: !6, line: 49, baseType: !731, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!651, !726, !734, !519}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !727, file: !6, line: 51, baseType: !736, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!651, !726, !734, !66, !663}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !727, file: !6, line: 53, baseType: !740, size: 64, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !575, !66}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !727, file: !6, line: 54, baseType: !744, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!105, !575}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !727, file: !6, line: 55, baseType: !748, size: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !575}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !576, file: !6, line: 236, baseType: !66, size: 64, offset: 1408)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "srcversion", scope: !576, file: !6, line: 237, baseType: !66, size: 64, offset: 1472)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "holders_dir", scope: !576, file: !6, line: 238, baseType: !594, size: 64, offset: 1536)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "syms", scope: !576, file: !6, line: 241, baseType: !755, size: 64, offset: 1600)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "crcs", scope: !576, file: !6, line: 242, baseType: !757, size: 64, offset: 1664)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "num_syms", scope: !576, file: !6, line: 243, baseType: !111, size: 32, offset: 1728)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "kp", scope: !576, file: !6, line: 246, baseType: !761, size: 64, offset: 1792)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !763, line: 48, size: 256, elements: !764)
!763 = !DIFile(filename: "include/linux/moduleparam.h", directory: "/data/android/android-7.0/kernel/msm")
!764 = !{!765, !766, !782, !783, !786}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !762, file: !763, line: 49, baseType: !66, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !762, file: !763, line: 50, baseType: !767, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !763, line: 39, size: 192, elements: !770)
!770 = !{!771, !777, !781}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !769, file: !763, line: 41, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!105, !66, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !769, file: !763, line: 43, baseType: !778, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!105, !519, !775}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !769, file: !763, line: 45, baseType: !700, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !762, file: !763, line: 51, baseType: !138, size: 16, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !762, file: !763, line: 52, baseType: !784, size: 16, offset: 144)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !139, line: 18, baseType: !785)
!785 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!786 = !DIDerivedType(tag: DW_TAG_member, scope: !762, file: !763, line: 53, baseType: !787, size: 64, offset: 192)
!787 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !762, file: !763, line: 53, size: 64, elements: !788)
!788 = !{!789, !790, !797}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !787, file: !763, line: 54, baseType: !169, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !787, file: !763, line: 55, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !763, line: 61, size: 128, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !793, file: !763, line: 62, baseType: !111, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !793, file: !763, line: 63, baseType: !519, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !787, file: !763, line: 56, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !763, line: 67, size: 256, elements: !801)
!801 = !{!802, !803, !804, !806, !807}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !800, file: !763, line: 69, baseType: !111, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !800, file: !763, line: 70, baseType: !111, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !800, file: !763, line: 71, baseType: !805, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !800, file: !763, line: 72, baseType: !767, size: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !800, file: !763, line: 73, baseType: !169, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "num_kp", scope: !576, file: !6, line: 247, baseType: !111, size: 32, offset: 1856)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "num_gpl_syms", scope: !576, file: !6, line: 250, baseType: !111, size: 32, offset: 1888)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_syms", scope: !576, file: !6, line: 251, baseType: !755, size: 64, offset: 1920)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_crcs", scope: !576, file: !6, line: 252, baseType: !757, size: 64, offset: 1984)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_future_syms", scope: !576, file: !6, line: 272, baseType: !755, size: 64, offset: 2048)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_future_crcs", scope: !576, file: !6, line: 273, baseType: !757, size: 64, offset: 2112)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "num_gpl_future_syms", scope: !576, file: !6, line: 274, baseType: !111, size: 32, offset: 2176)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "num_exentries", scope: !576, file: !6, line: 277, baseType: !111, size: 32, offset: 2208)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "extable", scope: !576, file: !6, line: 278, baseType: !817, size: 64, offset: 2240)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exception_table_entry", file: !819, line: 48, size: 128, elements: !820)
!819 = !DIFile(filename: "/data/android/android-7.0/kernel/msm/arch/arm64/include/asm/uaccess.h", directory: "/data/android/android-7.0/kernel/msm")
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "insn", scope: !818, file: !819, line: 50, baseType: !64, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fixup", scope: !818, file: !819, line: 50, baseType: !64, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !576, file: !6, line: 281, baseType: !824, size: 64, offset: 2304)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "module_init", scope: !576, file: !6, line: 284, baseType: !169, size: 64, offset: 2368)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "module_core", scope: !576, file: !6, line: 287, baseType: !169, size: 64, offset: 2432)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "init_size", scope: !576, file: !6, line: 290, baseType: !111, size: 32, offset: 2496)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "core_size", scope: !576, file: !6, line: 290, baseType: !111, size: 32, offset: 2528)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "init_text_size", scope: !576, file: !6, line: 293, baseType: !111, size: 32, offset: 2560)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "core_text_size", scope: !576, file: !6, line: 293, baseType: !111, size: 32, offset: 2592)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "init_ro_size", scope: !576, file: !6, line: 296, baseType: !111, size: 32, offset: 2624)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "core_ro_size", scope: !576, file: !6, line: 296, baseType: !111, size: 32, offset: 2656)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !576, file: !6, line: 299, baseType: !834, offset: 2688)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mod_arch_specific", file: !835, line: 9, elements: !106)
!835 = !DIFile(filename: "include/asm-generic/module.h", directory: "/data/android/android-7.0/kernel/msm")
!836 = !DIDerivedType(tag: DW_TAG_member, name: "taints", scope: !576, file: !6, line: 301, baseType: !111, size: 32, offset: 2688)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "num_bugs", scope: !576, file: !6, line: 305, baseType: !111, size: 32, offset: 2720)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bug_list", scope: !576, file: !6, line: 306, baseType: !143, size: 128, offset: 2752)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "bug_table", scope: !576, file: !6, line: 307, baseType: !840, size: 64, offset: 2880)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bug_entry", file: !842, line: 18, size: 192, elements: !843)
!842 = !DIFile(filename: "include/asm-generic/bug.h", directory: "/data/android/android-7.0/kernel/msm")
!843 = !{!844, !845, !846, !847}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "bug_addr", scope: !841, file: !842, line: 20, baseType: !64, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !841, file: !842, line: 26, baseType: !66, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !841, file: !842, line: 30, baseType: !140, size: 16, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !841, file: !842, line: 32, baseType: !140, size: 16, offset: 144)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !576, file: !6, line: 316, baseType: !849, size: 64, offset: 2944)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Sym", file: !851, line: 198, baseType: !852)
!851 = !DIFile(filename: "include/uapi/linux/elf.h", directory: "/data/android/android-7.0/kernel/msm")
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elf64_sym", file: !851, line: 191, size: 192, elements: !853)
!853 = !{!854, !856, !857, !858, !861, !864}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "st_name", scope: !852, file: !851, line: 192, baseType: !855, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Word", file: !851, line: 20, baseType: !553)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "st_info", scope: !852, file: !851, line: 193, baseType: !292, size: 8, offset: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "st_other", scope: !852, file: !851, line: 194, baseType: !292, size: 8, offset: 40)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "st_shndx", scope: !852, file: !851, line: 195, baseType: !859, size: 16, offset: 48)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Half", file: !851, line: 16, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !554, line: 23, baseType: !140)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "st_value", scope: !852, file: !851, line: 196, baseType: !862, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Addr", file: !851, line: 15, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !554, line: 30, baseType: !209)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !852, file: !851, line: 197, baseType: !865, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Xword", file: !851, line: 21, baseType: !863)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "core_symtab", scope: !576, file: !6, line: 316, baseType: !849, size: 64, offset: 3008)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "num_symtab", scope: !576, file: !6, line: 317, baseType: !111, size: 32, offset: 3072)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "core_num_syms", scope: !576, file: !6, line: 317, baseType: !111, size: 32, offset: 3104)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "strtab", scope: !576, file: !6, line: 318, baseType: !519, size: 64, offset: 3136)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "core_strtab", scope: !576, file: !6, line: 318, baseType: !519, size: 64, offset: 3200)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "sect_attrs", scope: !576, file: !6, line: 321, baseType: !872, size: 64, offset: 3264)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_sect_attrs", file: !6, line: 321, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "notes_attrs", scope: !576, file: !6, line: 324, baseType: !875, size: 64, offset: 3328)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_notes_attrs", file: !6, line: 324, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !576, file: !6, line: 329, baseType: !519, size: 64, offset: 3392)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "percpu", scope: !576, file: !6, line: 333, baseType: !169, size: 64, offset: 3456)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "percpu_size", scope: !576, file: !6, line: 334, baseType: !111, size: 32, offset: 3520)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "num_tracepoints", scope: !576, file: !6, line: 338, baseType: !111, size: 32, offset: 3552)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "tracepoints_ptrs", scope: !576, file: !6, line: 339, baseType: !882, size: 64, offset: 3584)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tracepoint", file: !886, line: 30, size: 320, elements: !887)
!886 = !DIFile(filename: "include/linux/tracepoint.h", directory: "/data/android/android-7.0/kernel/msm")
!887 = !{!888, !889, !894, !898, !899}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !885, file: !886, line: 31, baseType: !66, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !885, file: !886, line: 32, baseType: !890, size: 32, offset: 64)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "static_key", file: !891, line: 136, size: 32, elements: !892)
!891 = !DIFile(filename: "include/linux/jump_label.h", directory: "/data/android/android-7.0/kernel/msm")
!892 = !{!893}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !890, file: !891, line: 137, baseType: !154, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "regfunc", scope: !885, file: !886, line: 33, baseType: !895, size: 64, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{null}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "unregfunc", scope: !885, file: !886, line: 34, baseType: !895, size: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !885, file: !886, line: 35, baseType: !900, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tracepoint_func", file: !886, line: 25, size: 128, elements: !902)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !901, file: !886, line: 26, baseType: !169, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !901, file: !886, line: 27, baseType: !169, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "num_trace_bprintk_fmt", scope: !576, file: !6, line: 346, baseType: !111, size: 32, offset: 3648)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "trace_bprintk_fmt_start", scope: !576, file: !6, line: 347, baseType: !907, size: 64, offset: 3712)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "trace_events", scope: !576, file: !6, line: 350, baseType: !909, size: 64, offset: 3776)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "ftrace_event_call", file: !6, line: 350, flags: DIFlagFwdDecl)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "num_trace_events", scope: !576, file: !6, line: 351, baseType: !111, size: 32, offset: 3840)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !562, file: !402, line: 1848, baseType: !561, size: 64, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !562, file: !402, line: 1849, baseType: !915, size: 64, offset: 384)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !144, line: 189, size: 64, elements: !916)
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !915, file: !144, line: 190, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !144, line: 193, size: 128, elements: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !919, file: !144, line: 194, baseType: !918, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !919, file: !144, line: 194, baseType: !923, size: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !562, file: !402, line: 1851, baseType: !925, offset: 448)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !926, line: 411, elements: !106)
!926 = !DIFile(filename: "include/linux/lockdep.h", directory: "/data/android/android-7.0/kernel/msm")
!927 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !562, file: !402, line: 1852, baseType: !925, offset: 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !562, file: !402, line: 1853, baseType: !925, offset: 448)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !562, file: !402, line: 1854, baseType: !930, offset: 448)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 3)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !562, file: !402, line: 1856, baseType: !925, offset: 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !562, file: !402, line: 1857, baseType: !925, offset: 448)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !562, file: !402, line: 1858, baseType: !925, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !547, file: !402, line: 1255, baseType: !937, size: 64, offset: 384)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !402, line: 1623, size: 1280, elements: !940)
!940 = !{!941, !945, !949, !953, !959, !963, !964, !965, !969, !973, !974, !980, !985, !986, !1027, !1028, !1029, !1030, !1035, !1036}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !939, file: !402, line: 1624, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!405, !546}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !939, file: !402, line: 1625, baseType: !946, size: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !405}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !939, file: !402, line: 1627, baseType: !950, size: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !405, !105}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !939, file: !402, line: 1628, baseType: !954, size: 64, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!105, !405, !957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !377, line: 30, flags: DIFlagFwdDecl)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !939, file: !402, line: 1629, baseType: !960, size: 64, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!105, !405}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !939, file: !402, line: 1630, baseType: !946, size: 64, offset: 320)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !939, file: !402, line: 1631, baseType: !571, size: 64, offset: 384)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !939, file: !402, line: 1632, baseType: !966, size: 64, offset: 448)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!105, !546, !105}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !939, file: !402, line: 1633, baseType: !970, size: 64, offset: 512)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!105, !546}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !939, file: !402, line: 1634, baseType: !970, size: 64, offset: 576)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !939, file: !402, line: 1635, baseType: !975, size: 64, offset: 640)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!105, !435, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !402, line: 42, flags: DIFlagFwdDecl)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !939, file: !402, line: 1636, baseType: !981, size: 64, offset: 704)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!105, !546, !984, !519}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !939, file: !402, line: 1637, baseType: !571, size: 64, offset: 768)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !939, file: !402, line: 1639, baseType: !987, size: 64, offset: 832)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!105, !990, !435}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !992, line: 18, size: 1024, elements: !993)
!992 = !DIFile(filename: "include/linux/seq_file.h", directory: "/data/android/android-7.0/kernel/msm")
!993 = !{!994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1025, !1026}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !991, file: !992, line: 19, baseType: !519, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !991, file: !992, line: 20, baseType: !663, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !991, file: !992, line: 21, baseType: !663, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !991, file: !992, line: 22, baseType: !663, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "pad_until", scope: !991, file: !992, line: 23, baseType: !663, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !991, file: !992, line: 24, baseType: !558, size: 64, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !991, file: !992, line: 25, baseType: !558, size: 64, offset: 384)
