; ModuleID = '/home/chenql/code/EHTestDir/EHTest_Release_1.1/android-3.10/nfc/pn548.c'
source_filename = "/home/chenql/code/EHTestDir/EHTest_Release_1.1/android-3.10/nfc/pn548.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64--linux-android"

%struct.wake_lock = type { %struct.wakeup_source }
%struct.wakeup_source = type { i8*, %struct.list_head, %struct.callback_head, %struct.spinlock, %struct.timer_list, i64, %union.ktime, %union.ktime, %union.ktime, %union.ktime, %union.ktime, i64, i64, i64, i64, i64, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.callback_head = type { %struct.callback_head*, void (%struct.callback_head*)* }
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type { i16, i16 }
%struct.timer_list = type { %struct.list_head, i64, %struct.tvec_base*, void (i64)*, i64, i32, i32, i8*, [16 x i8] }
%struct.tvec_base = type opaque
%union.ktime = type { i64 }

!1 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author498", scope: !2, file: !3, line: 498, type: !3648, isLocal: true, isDefinition: true, align: 8)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !72, globals: !2874)
!3 = !DIFile(filename: "/home/chenql/code/EHTestDir/EHTest_Release_1.1/android-3.10/nfc/pn548.c", directory: "/data/android/android-7.0/kernel/msm")
!4 = !{!5, !12, !18, !24, !31, !37, !42, !50, !56, !61, !66}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "module_state", file: !6, line: 202, size: 32, elements: !7)
!6 = !DIFile(filename: "include/linux/module.h", directory: "/data/android/android-7.0/kernel/msm")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "MODULE_STATE_LIVE", value: 0)
!9 = !DIEnumerator(name: "MODULE_STATE_COMING", value: 1)
!10 = !DIEnumerator(name: "MODULE_STATE_GOING", value: 2)
!11 = !DIEnumerator(name: "MODULE_STATE_UNFORMED", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !13, line: 27, size: 32, elements: !14)
!13 = !DIFile(filename: "include/linux/kobject_ns.h", directory: "/data/android/android-7.0/kernel/msm")
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0)
!16 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1)
!17 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quota_type", file: !19, line: 53, size: 32, elements: !20)
!19 = !DIFile(filename: "include/linux/quota.h", directory: "/data/android/android-7.0/kernel/msm")
!20 = !{!21, !22, !23}
!21 = !DIEnumerator(name: "USRQUOTA", value: 0)
!22 = !DIEnumerator(name: "GRPQUOTA", value: 1)
!23 = !DIEnumerator(name: "PRJQUOTA", value: 2)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !25, line: 6, size: 32, elements: !26)
!25 = !DIFile(filename: "include/linux/pid.h", directory: "/data/android/android-7.0/kernel/msm")
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "PIDTYPE_PID", value: 0)
!28 = !DIEnumerator(name: "PIDTYPE_PGID", value: 1)
!29 = !DIEnumerator(name: "PIDTYPE_SID", value: 2)
!30 = !DIEnumerator(name: "PIDTYPE_MAX", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "migrate_mode", file: !32, line: 10, size: 32, elements: !33)
!32 = !DIFile(filename: "include/linux/migrate_mode.h", directory: "/data/android/android-7.0/kernel/msm")
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "MIGRATE_ASYNC", value: 0)
!35 = !DIEnumerator(name: "MIGRATE_SYNC_LIGHT", value: 1)
!36 = !DIEnumerator(name: "MIGRATE_SYNC", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !38, line: 44, size: 32, elements: !39)
!38 = !DIFile(filename: "include/linux/hrtimer.h", directory: "/data/android/android-7.0/kernel/msm")
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0)
!41 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !43, line: 492, size: 32, elements: !44)
!43 = !DIFile(filename: "include/linux/pm.h", directory: "/data/android/android-7.0/kernel/msm")
!44 = !{!45, !46, !47, !48, !49}
!45 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0)
!46 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1)
!47 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2)
!48 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3)
!49 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !43, line: 470, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "RPM_ACTIVE", value: 0)
!53 = !DIEnumerator(name: "RPM_RESUMING", value: 1)
!54 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2)
!55 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 27, size: 32, elements: !58)
!57 = !DIFile(filename: "include/linux/wakelock.h", directory: "/data/android/android-7.0/kernel/msm")
!58 = !{!59, !60}
!59 = !DIEnumerator(name: "WAKE_LOCK_SUSPEND", value: 0)
!60 = !DIEnumerator(name: "WAKE_LOCK_TYPE_COUNT", value: 1)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 10, size: 32, elements: !63)
!62 = !DIFile(filename: "include/linux/stddef.h", directory: "/data/android/android-7.0/kernel/msm")
!63 = !{!64, !65}
!64 = !DIEnumerator(name: "false", value: 0)
!65 = !DIEnumerator(name: "true", value: 1)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irqreturn", file: !67, line: 10, size: 32, elements: !68)
!67 = !DIFile(filename: "include/linux/irqreturn.h", directory: "/data/android/android-7.0/kernel/msm")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "IRQ_NONE", value: 0)
!70 = !DIEnumerator(name: "IRQ_HANDLED", value: 1)
!71 = !DIEnumerator(name: "IRQ_WAKE_THREAD", value: 2)
!72 = !{!73, !74, !77, !2118, !76}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !75, line: 157, baseType: !76)
!75 = !DIFile(filename: "include/linux/types.h", directory: "/data/android/android-7.0/kernel/msm")
!76 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !79, line: 46, size: 704, elements: !80)
!79 = !DIFile(filename: "/data/android/android-7.0/kernel/msm/arch/arm64/include/asm/thread_info.h", directory: "/data/android/android-7.0/kernel/msm")
!80 = !{!81, !83, !85, !2823, !2826, !2872, !2873}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !78, file: !79, line: 47, baseType: !82, size: 64)
!82 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "addr_limit", scope: !78, file: !79, line: 48, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_segment_t", file: !79, line: 40, baseType: !82)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !78, file: !79, line: 49, baseType: !86, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !88, line: 1169, size: 22016, elements: !89)
!88 = !DIFile(filename: "include/linux/sched.h", directory: "/data/android/android-7.0/kernel/msm")
!89 = !{!90, !93, !94, !100, !101, !102, !108, !109, !110, !111, !112, !113, !114, !118, !197, !211, !221, !222, !223, !226, !228, !229, !230, !231, !240, !241, !243, !244, !247, !272, !279, !280, !286, !2313, !2314, !2315, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2351, !2352, !2353, !2355, !2356, !2357, !2360, !2361, !2362, !2363, !2364, !2365, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2382, !2384, !2385, !2386, !2388, !2389, !2390, !2448, !2451, !2452, !2471, !2631, !2660, !2661, !2662, !2663, !2664, !2665, !2666, !2670, !2671, !2673, !2674, !2678, !2686, !2687, !2688, !2689, !2690, !2691, !2694, !2695, !2698, !2701, !2704, !2705, !2709, !2710, !2777, !2778, !2784, !2785, !2786, !2787, !2790, !2791, !2794, !2797, !2798, !2801, !2805, !2806, !2807, !2808, !2809, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !87, file: !88, line: 1170, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !92)
!92 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !87, file: !88, line: 1171, baseType: !73, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !87, file: !88, line: 1172, baseType: !95, size: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !75, line: 177, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 175, size: 32, elements: !97)
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !96, file: !75, line: 176, baseType: !99, size: 32)
!99 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !87, file: !88, line: 1173, baseType: !76, size: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !87, file: !88, line: 1174, baseType: !76, size: 32, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "wake_entry", scope: !87, file: !88, line: 1177, baseType: !103, size: 64, offset: 256)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !104, line: 65, size: 64, elements: !105)
!104 = !DIFile(filename: "include/linux/llist.h", directory: "/data/android/android-7.0/kernel/msm")
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !103, file: !104, line: 66, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "on_cpu", scope: !87, file: !88, line: 1178, baseType: !99, size: 32, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !87, file: !88, line: 1180, baseType: !99, size: 32, offset: 352)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !87, file: !88, line: 1182, baseType: !99, size: 32, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !87, file: !88, line: 1182, baseType: !99, size: 32, offset: 416)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !87, file: !88, line: 1182, baseType: !99, size: 32, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !87, file: !88, line: 1183, baseType: !76, size: 32, offset: 480)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !87, file: !88, line: 1184, baseType: !115, size: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !88, line: 1184, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !87, file: !88, line: 1185, baseType: !119, size: 3072, offset: 576)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !88, line: 1086, size: 3072, elements: !120)
!120 = !{!121, !126, !134, !140, !141, !145, !146, !147, !148, !149, !181, !183, !186, !187}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !119, file: !88, line: 1087, baseType: !122, size: 128)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !88, line: 997, size: 128, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !122, file: !88, line: 998, baseType: !82, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !122, file: !88, line: 998, baseType: !82, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !119, file: !88, line: 1088, baseType: !127, size: 192, align: 64, offset: 128)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !128, line: 35, size: 192, align: 64, elements: !129)
!128 = !DIFile(filename: "include/linux/rbtree.h", directory: "/data/android/android-7.0/kernel/msm")
!129 = !{!130, !131, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !127, file: !128, line: 36, baseType: !82, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !127, file: !128, line: 37, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !127, file: !128, line: 38, baseType: !132, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !119, file: !88, line: 1089, baseType: !135, size: 128, offset: 320)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !75, line: 185, size: 128, elements: !136)
!136 = !{!137, !139}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !75, line: 186, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !75, line: 186, baseType: !138, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !119, file: !88, line: 1090, baseType: !76, size: 32, offset: 448)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !119, file: !88, line: 1092, baseType: !142, size: 64, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !143, line: 25, baseType: !144)
!143 = !DIFile(filename: "include/asm-generic/int-ll64.h", directory: "/data/android/android-7.0/kernel/msm")
!144 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !119, file: !88, line: 1093, baseType: !142, size: 64, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !119, file: !88, line: 1094, baseType: !142, size: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !119, file: !88, line: 1095, baseType: !142, size: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !119, file: !88, line: 1097, baseType: !142, size: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !119, file: !88, line: 1100, baseType: !150, size: 1728, offset: 832)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !88, line: 1017, size: 1728, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !160, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "wait_start", scope: !150, file: !88, line: 1018, baseType: !142, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "wait_max", scope: !150, file: !88, line: 1019, baseType: !142, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "wait_count", scope: !150, file: !88, line: 1020, baseType: !142, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "wait_sum", scope: !150, file: !88, line: 1021, baseType: !142, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_count", scope: !150, file: !88, line: 1022, baseType: !142, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_sum", scope: !150, file: !88, line: 1023, baseType: !142, size: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_start", scope: !150, file: !88, line: 1025, baseType: !142, size: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_max", scope: !150, file: !88, line: 1026, baseType: !142, size: 64, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sum_sleep_runtime", scope: !150, file: !88, line: 1027, baseType: !161, size: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !143, line: 24, baseType: !162)
!162 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "block_start", scope: !150, file: !88, line: 1029, baseType: !142, size: 64, offset: 576)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "block_max", scope: !150, file: !88, line: 1030, baseType: !142, size: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "exec_max", scope: !150, file: !88, line: 1031, baseType: !142, size: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "slice_max", scope: !150, file: !88, line: 1032, baseType: !142, size: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations_cold", scope: !150, file: !88, line: 1034, baseType: !142, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_affine", scope: !150, file: !88, line: 1035, baseType: !142, size: 64, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_running", scope: !150, file: !88, line: 1036, baseType: !142, size: 64, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_hot", scope: !150, file: !88, line: 1037, baseType: !142, size: 64, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nr_forced_migrations", scope: !150, file: !88, line: 1038, baseType: !142, size: 64, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups", scope: !150, file: !88, line: 1040, baseType: !142, size: 64, offset: 1152)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_sync", scope: !150, file: !88, line: 1041, baseType: !142, size: 64, offset: 1216)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_migrate", scope: !150, file: !88, line: 1042, baseType: !142, size: 64, offset: 1280)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_local", scope: !150, file: !88, line: 1043, baseType: !142, size: 64, offset: 1344)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_remote", scope: !150, file: !88, line: 1044, baseType: !142, size: 64, offset: 1408)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine", scope: !150, file: !88, line: 1045, baseType: !142, size: 64, offset: 1472)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine_attempts", scope: !150, file: !88, line: 1046, baseType: !142, size: 64, offset: 1536)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_passive", scope: !150, file: !88, line: 1047, baseType: !142, size: 64, offset: 1600)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_idle", scope: !150, file: !88, line: 1048, baseType: !142, size: 64, offset: 1664)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !119, file: !88, line: 1104, baseType: !182, size: 64, offset: 2560)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "cfs_rq", scope: !119, file: !88, line: 1106, baseType: !184, size: 64, offset: 2624)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "cfs_rq", file: !88, line: 186, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "my_q", scope: !119, file: !88, line: 1108, baseType: !184, size: 64, offset: 2688)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "avg", scope: !119, file: !88, line: 1118, baseType: !188, size: 320, offset: 2752)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_avg", file: !88, line: 1001, size: 320, elements: !189)
!189 = !{!190, !192, !193, !194, !195, !196}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "runnable_avg_sum", scope: !188, file: !88, line: 1007, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !143, line: 22, baseType: !76)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "runnable_avg_period", scope: !188, file: !88, line: 1007, baseType: !191, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "runnable_avg_sum_scaled", scope: !188, file: !88, line: 1009, baseType: !191, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "last_runnable_update", scope: !188, file: !88, line: 1011, baseType: !142, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "decay_count", scope: !188, file: !88, line: 1012, baseType: !161, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "load_avg_contrib", scope: !188, file: !88, line: 1013, baseType: !82, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !87, file: !88, line: 1186, baseType: !198, size: 576, offset: 3648)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !88, line: 1122, size: 576, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !206, !207, !210}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !198, file: !88, line: 1123, baseType: !135, size: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !198, file: !88, line: 1124, baseType: !82, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !198, file: !88, line: 1125, baseType: !82, size: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !198, file: !88, line: 1126, baseType: !76, size: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !198, file: !88, line: 1128, baseType: !205, size: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !198, file: !88, line: 1130, baseType: !205, size: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rq", scope: !198, file: !88, line: 1132, baseType: !208, size: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_rq", file: !88, line: 1132, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "my_q", scope: !198, file: !88, line: 1134, baseType: !208, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ravg", scope: !87, file: !88, line: 1188, baseType: !212, size: 320, offset: 4224)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ravg", file: !88, line: 1055, size: 320, elements: !213)
!213 = !{!214, !215, !216, !217}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mark_start", scope: !212, file: !88, line: 1078, baseType: !142, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !212, file: !88, line: 1079, baseType: !191, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "demand", scope: !212, file: !88, line: 1079, baseType: !191, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sum_history", scope: !212, file: !88, line: 1080, baseType: !218, size: 160, offset: 128)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 160, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 5)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "init_load_pct", scope: !87, file: !88, line: 1193, baseType: !191, size: 32, offset: 4544)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "run_start", scope: !87, file: !88, line: 1194, baseType: !142, size: 64, offset: 4608)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "sched_task_group", scope: !87, file: !88, line: 1197, baseType: !224, size: 64, offset: 4672)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "task_group", file: !88, line: 187, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_counter", scope: !87, file: !88, line: 1213, baseType: !227, size: 8, offset: 4736)
!227 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "btrace_seq", scope: !87, file: !88, line: 1215, baseType: !76, size: 32, offset: 4768)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !87, file: !88, line: 1218, baseType: !76, size: 32, offset: 4800)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !87, file: !88, line: 1219, baseType: !99, size: 32, offset: 4832)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_allowed", scope: !87, file: !88, line: 1220, baseType: !232, size: 64, offset: 4864)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !233, line: 14, baseType: !234)
!233 = !DIFile(filename: "include/linux/cpumask.h", directory: "/data/android/android-7.0/kernel/msm")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !233, line: 14, size: 64, elements: !235)
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !234, file: !233, line: 14, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 64, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 1)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_read_lock_nesting", scope: !87, file: !88, line: 1223, baseType: !99, size: 32, offset: 4928)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_read_unlock_special", scope: !87, file: !88, line: 1224, baseType: !242, size: 8, offset: 4960)
!242 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_node_entry", scope: !87, file: !88, line: 1225, baseType: !135, size: 128, offset: 4992)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_blocked_node", scope: !87, file: !88, line: 1228, baseType: !245, size: 64, offset: 5120)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "rcu_node", file: !88, line: 1139, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_boost_mutex", scope: !87, file: !88, line: 1231, baseType: !248, size: 64, offset: 5184)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex", file: !250, line: 28, size: 256, elements: !251)
!250 = !DIFile(filename: "include/linux/rtmutex.h", directory: "/data/android/android-7.0/kernel/msm")
!251 = !{!252, !266, !271}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !249, file: !250, line: 29, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !254, line: 32, baseType: !255)
!254 = !DIFile(filename: "include/linux/spinlock_types.h", directory: "/data/android/android-7.0/kernel/msm")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !254, line: 20, size: 32, elements: !256)
!256 = !{!257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !255, file: !254, line: 21, baseType: !258, size: 32, align: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !259, line: 33, baseType: !260)
!259 = !DIFile(filename: "/data/android/android-7.0/kernel/msm/arch/arm64/include/asm/spinlock_types.h", directory: "/data/android/android-7.0/kernel/msm")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !259, line: 25, size: 32, align: 32, elements: !261)
!261 = !{!262, !265}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !260, file: !259, line: 30, baseType: !263, size: 16)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !143, line: 19, baseType: !264)
!264 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !259, line: 31, baseType: !263, size: 16, offset: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !249, file: !250, line: 30, baseType: !267, size: 128, offset: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plist_head", file: !268, line: 81, size: 128, elements: !269)
!268 = !DIFile(filename: "include/linux/plist.h", directory: "/data/android/android-7.0/kernel/msm")
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "node_list", scope: !267, file: !268, line: 82, baseType: !135, size: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !249, file: !250, line: 31, baseType: !86, size: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !87, file: !88, line: 1235, baseType: !273, size: 256, offset: 5248)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !88, line: 772, size: 256, elements: !274)
!274 = !{!275, !276, !277, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pcount", scope: !273, file: !88, line: 774, baseType: !82, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "run_delay", scope: !273, file: !88, line: 775, baseType: !144, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "last_arrival", scope: !273, file: !88, line: 778, baseType: !144, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "last_queued", scope: !273, file: !88, line: 779, baseType: !144, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !87, file: !88, line: 1238, baseType: !135, size: 128, offset: 5504)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pushable_tasks", scope: !87, file: !88, line: 1240, baseType: !281, size: 320, offset: 5632)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plist_node", file: !268, line: 85, size: 320, elements: !282)
!282 = !{!283, !284, !285}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !281, file: !268, line: 86, baseType: !99, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prio_list", scope: !281, file: !268, line: 87, baseType: !135, size: 128, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "node_list", scope: !281, file: !268, line: 88, baseType: !135, size: 128, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !87, file: !88, line: 1243, baseType: !287, size: 64, offset: 5952)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !289, line: 340, size: 5952, elements: !290)
!289 = !DIFile(filename: "include/linux/mm_types.h", directory: "/data/android/android-7.0/kernel/msm")
!290 = !{!291, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2269, !2274, !2277, !2280, !2288, !2289, !2306, !2307, !2308, !2309, !2310}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !288, file: !289, line: 341, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !289, line: 238, size: 1408, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !306, !307, !319, !320, !323, !2224, !2225, !2226}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !293, file: !289, line: 241, baseType: !82, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !293, file: !289, line: 242, baseType: !82, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !293, file: !289, line: 246, baseType: !292, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !293, file: !289, line: 246, baseType: !292, size: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !293, file: !289, line: 248, baseType: !127, size: 192, align: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !293, file: !289, line: 256, baseType: !82, size: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !293, file: !289, line: 260, baseType: !287, size: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vm_page_prot", scope: !293, file: !289, line: 261, baseType: !303, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprot_t", file: !304, line: 52, baseType: !305)
!304 = !DIFile(filename: "/data/android/android-7.0/kernel/msm/arch/arm64/include/asm/pgtable-3level-types.h", directory: "/data/android/android-7.0/kernel/msm")
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "pteval_t", file: !304, line: 21, baseType: !142)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "vm_flags", scope: !293, file: !289, line: 262, baseType: !82, size: 64, offset: 640)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !293, file: !289, line: 280, baseType: !308, size: 256, offset: 704)
!308 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !293, file: !289, line: 273, size: 256, elements: !309)
!309 = !{!310, !315, !316}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "linear", scope: !308, file: !289, line: 277, baseType: !311, size: 256)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !308, file: !289, line: 274, size: 256, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !311, file: !289, line: 275, baseType: !127, size: 192, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_last", scope: !311, file: !289, line: 276, baseType: !82, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "nonlinear", scope: !308, file: !289, line: 278, baseType: !135, size: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "anon_name", scope: !308, file: !289, line: 279, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma_chain", scope: !293, file: !289, line: 288, baseType: !135, size: 128, offset: 960)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma", scope: !293, file: !289, line: 290, baseType: !321, size: 64, offset: 1088)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "anon_vma", file: !289, line: 290, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !293, file: !289, line: 293, baseType: !324, size: 64, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !327, line: 215, size: 384, elements: !328)
!327 = !DIFile(filename: "include/linux/mm.h", directory: "/data/android/android-7.0/kernel/msm")
!328 = !{!329, !333, !334, !2215, !2216, !2220}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !326, file: !327, line: 216, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !292}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !326, file: !327, line: 217, baseType: !330, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "fault", scope: !326, file: !327, line: 218, baseType: !335, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!99, !292, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_fault", file: !327, line: 198, size: 256, elements: !340)
!340 = !{!341, !342, !343, !344}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !339, file: !327, line: 199, baseType: !76, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pgoff", scope: !339, file: !327, line: 200, baseType: !82, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_address", scope: !339, file: !327, line: 201, baseType: !73, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !339, file: !327, line: 203, baseType: !345, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !289, line: 42, size: 512, elements: !347)
!347 = !{!348, !349, !2165, !2193, !2207, !2214}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !346, file: !289, line: 44, baseType: !82, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !346, file: !289, line: 46, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !352, line: 413, size: 1344, align: 64, elements: !353)
!352 = !DIFile(filename: "include/linux/fs.h", directory: "/data/android/android-7.0/kernel/msm")
!353 = !{!354, !2040, !2049, !2050, !2051, !2055, !2056, !2057, !2058, !2059, !2160, !2161, !2162, !2163, !2164}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !351, file: !352, line: 414, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !352, line: 528, size: 4416, elements: !357)
!357 = !{!358, !360, !361, !367, !371, !372, !375, !376, !1988, !1989, !1990, !1991, !1992, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2036, !2037, !2038, !2039}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !356, file: !352, line: 529, baseType: !359, size: 16)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !75, line: 18, baseType: !264)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !356, file: !352, line: 530, baseType: !264, size: 16, offset: 16)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !356, file: !352, line: 531, baseType: !362, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !363, line: 46, baseType: !364)
!363 = !DIFile(filename: "include/linux/uidgid.h", directory: "/data/android/android-7.0/kernel/msm")
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !75, line: 31, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !366, line: 48, baseType: !76)
!366 = !DIFile(filename: "/data/android/android-7.0/kernel/msm/include/uapi/asm-generic/posix_types.h", directory: "/data/android/android-7.0/kernel/msm")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !356, file: !352, line: 532, baseType: !368, size: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !363, line: 47, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !75, line: 32, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !366, line: 49, baseType: !76)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !356, file: !352, line: 533, baseType: !76, size: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_acl", scope: !356, file: !352, line: 536, baseType: !373, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !352, line: 516, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_default_acl", scope: !356, file: !352, line: 537, baseType: !373, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !356, file: !352, line: 540, baseType: !377, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !352, line: 1579, size: 1536, align: 512, elements: !380)
!380 = !{!381, !1380, !1386, !1390, !1394, !1398, !1402, !1406, !1410, !1414, !1418, !1422, !1423, !1427, !1431, !1919, !1940, !1944, !1948, !1952, !1956, !1979, !1984}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !379, file: !352, line: 1580, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!385, !355, !385, !76}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !387, line: 103, size: 1536, elements: !388)
!387 = !DIFile(filename: "include/linux/dcache.h", directory: "/data/android/android-7.0/kernel/msm")
!388 = !{!389, !390, !396, !404, !405, !420, !421, !425, !426, !434, !502, !1362, !1363, !1364, !1365, !1378, !1379}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !386, file: !387, line: 105, baseType: !76, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !386, file: !387, line: 106, baseType: !391, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !392, line: 41, baseType: !393)
!392 = !DIFile(filename: "include/linux/seqlock.h", directory: "/data/android/android-7.0/kernel/msm")
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !392, line: 39, size: 32, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !393, file: !392, line: 40, baseType: !76, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !386, file: !387, line: 107, baseType: !397, size: 128, offset: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !398, line: 37, size: 128, elements: !399)
!398 = !DIFile(filename: "include/linux/list_bl.h", directory: "/data/android/android-7.0/kernel/msm")
!399 = !{!400, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !397, file: !398, line: 38, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !397, file: !398, line: 38, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !386, file: !387, line: 108, baseType: !385, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !386, file: !387, line: 109, baseType: !406, size: 128, offset: 256)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !387, line: 42, size: 128, elements: !407)
!407 = !{!408, !417}
!408 = !DIDerivedType(tag: DW_TAG_member, scope: !406, file: !387, line: 43, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !406, file: !387, line: 43, size: 64, elements: !410)
!410 = !{!411, !416}
!411 = !DIDerivedType(tag: DW_TAG_member, scope: !409, file: !387, line: 44, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !409, file: !387, line: 44, size: 64, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !412, file: !387, line: 45, baseType: !191, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !412, file: !387, line: 45, baseType: !191, size: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !409, file: !387, line: 47, baseType: !142, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !406, file: !387, line: 49, baseType: !418, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !386, file: !387, line: 110, baseType: !355, size: 64, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "d_iname", scope: !386, file: !387, line: 112, baseType: !422, size: 256, offset: 448)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 256, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "d_count", scope: !386, file: !387, line: 115, baseType: !76, size: 32, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "d_lock", scope: !386, file: !387, line: 116, baseType: !427, size: 32, offset: 736)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !254, line: 76, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !254, line: 64, size: 32, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, scope: !428, file: !254, line: 65, baseType: !431, size: 32)
!431 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !428, file: !254, line: 65, size: 32, elements: !432)
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !431, file: !254, line: 66, baseType: !255, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "d_op", scope: !386, file: !387, line: 117, baseType: !435, size: 64, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry_operations", file: !387, line: 146, size: 1024, align: 512, elements: !438)
!438 = !{!439, !443, !444, !453, !459, !463, !467, !468, !472, !477, !490, !496}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "d_revalidate", scope: !437, file: !387, line: 147, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!99, !385, !76}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "d_weak_revalidate", scope: !437, file: !387, line: 148, baseType: !440, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !437, file: !387, line: 149, baseType: !445, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!99, !448, !450, !452}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "d_compare", scope: !437, file: !387, line: 151, baseType: !454, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!99, !448, !450, !448, !450, !76, !317, !457}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "d_delete", scope: !437, file: !387, line: 154, baseType: !460, size: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!99, !448}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "d_release", scope: !437, file: !387, line: 155, baseType: !464, size: 64, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !385}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "d_prune", scope: !437, file: !387, line: 156, baseType: !464, size: 64, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "d_iput", scope: !437, file: !387, line: 157, baseType: !469, size: 64, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !385, !355}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "d_dname", scope: !437, file: !387, line: 158, baseType: !473, size: 64, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!476, !385, !476, !99}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "d_automount", scope: !437, file: !387, line: 159, baseType: !478, size: 64, offset: 576)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!481, !484}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !483, line: 33, flags: DIFlagFwdDecl)
!483 = !DIFile(filename: "include/linux/pid_namespace.h", directory: "/data/android/android-7.0/kernel/msm")
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !486, line: 7, size: 128, elements: !487)
!486 = !DIFile(filename: "include/linux/path.h", directory: "/data/android/android-7.0/kernel/msm")
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !485, file: !486, line: 8, baseType: !481, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !485, file: !486, line: 9, baseType: !385, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "d_manage", scope: !437, file: !387, line: 160, baseType: !491, size: 64, offset: 640)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!99, !385, !494}
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !75, line: 29, baseType: !495)
!495 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "d_canonical_path", scope: !437, file: !387, line: 161, baseType: !497, size: 64, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !500, !484}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "d_sb", scope: !386, file: !387, line: 118, baseType: !503, size: 64, offset: 832)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !352, line: 1248, size: 8192, elements: !505)
!505 = !{!506, !507, !512, !513, !514, !517, !902, !1013, !1086, !1180, !1184, !1185, !1186, !1187, !1194, !1195, !1196, !1197, !1202, !1203, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1246, !1249, !1252, !1253, !1297, !1314, !1316, !1321, !1322, !1323, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1355, !1356, !1357, !1361}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !504, file: !352, line: 1249, baseType: !135, size: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !504, file: !352, line: 1250, baseType: !508, size: 32, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !75, line: 15, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !75, line: 12, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !511, line: 26, baseType: !76)
!511 = !DIFile(filename: "include/uapi/asm-generic/int-ll64.h", directory: "/data/android/android-7.0/kernel/msm")
!512 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !504, file: !352, line: 1251, baseType: !227, size: 8, offset: 160)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !504, file: !352, line: 1252, baseType: !82, size: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !504, file: !352, line: 1253, baseType: !515, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !75, line: 45, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !366, line: 87, baseType: !162)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !504, file: !352, line: 1254, baseType: !518, size: 64, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !352, line: 1835, size: 448, elements: !520)
!520 = !{!521, !522, !523, !527, !531, !879, !880, !890, !893, !894, !895, !899, !900, !901}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !519, file: !352, line: 1836, baseType: !317, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !519, file: !352, line: 1837, baseType: !99, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !519, file: !352, line: 1844, baseType: !524, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!385, !518, !99, !317, !73}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !519, file: !352, line: 1846, baseType: !528, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !503}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !519, file: !352, line: 1847, baseType: !532, size: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !6, line: 223, size: 3904, elements: !534)
!534 = !{!535, !536, !537, !541, !682, !708, !709, !710, !711, !719, !722, !723, !771, !772, !773, !774, !775, !776, !777, !778, !779, !786, !790, !791, !792, !793, !794, !795, !796, !797, !798, !802, !803, !804, !805, !814, !832, !833, !834, !835, !836, !837, !840, !843, !844, !845, !846, !847, !871, !872, !874, !878}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !533, file: !6, line: 225, baseType: !5, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !533, file: !6, line: 228, baseType: !135, size: 128, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !533, file: !6, line: 231, baseType: !538, size: 448, offset: 192)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 448, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 56)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mkobj", scope: !533, file: !6, line: 234, baseType: !542, size: 704, offset: 640)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_kobject", file: !6, line: 40, size: 704, elements: !543)
!543 = !{!544, !677, !678, !679}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !542, file: !6, line: 41, baseType: !545, size: 512)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !546, line: 60, size: 512, elements: !547)
!546 = !DIFile(filename: "include/linux/kobject.h", directory: "/data/android/android-7.0/kernel/msm")
!547 = !{!548, !549, !550, !552, !590, !664, !667, !672, !673, !674, !675, !676}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !545, file: !546, line: 61, baseType: !317, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !545, file: !546, line: 62, baseType: !135, size: 128, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !545, file: !546, line: 63, baseType: !551, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !545, file: !546, line: 64, baseType: !553, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !546, line: 159, size: 768, elements: !555)
!555 = !{!556, !557, !558, !559}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !554, file: !546, line: 160, baseType: !135, size: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !554, file: !546, line: 161, baseType: !427, size: 32, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !554, file: !546, line: 162, baseType: !545, size: 512, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !554, file: !546, line: 163, baseType: !560, size: 64, offset: 704)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !546, line: 123, size: 192, elements: !563)
!563 = !{!564, !569, !574}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !562, file: !546, line: 124, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!99, !553, !551}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !562, file: !546, line: 125, baseType: !570, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!317, !553, !551}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !562, file: !546, line: 126, baseType: !575, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!99, !553, !551, !579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !546, line: 116, size: 18496, elements: !581)
!581 = !{!582, !584, !585, !589}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !580, file: !546, line: 117, baseType: !583, size: 2048)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 2048, elements: !423)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !580, file: !546, line: 118, baseType: !99, size: 32, offset: 2048)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !580, file: !546, line: 119, baseType: !586, size: 16384, offset: 2080)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 16384, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 2048)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !580, file: !546, line: 120, baseType: !99, size: 32, offset: 18464)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !545, file: !546, line: 65, baseType: !591, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !546, line: 108, size: 320, elements: !593)
!593 = !{!594, !598, !631, !633, !660}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !592, file: !546, line: 109, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !551}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !592, file: !546, line: 110, baseType: !599, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !602, line: 124, size: 192, elements: !603)
!602 = !DIFile(filename: "include/linux/sysfs.h", directory: "/data/android/android-7.0/kernel/msm")
!603 = !{!604, !616, !623}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !601, file: !602, line: 125, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!608, !551, !611, !476}
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !75, line: 59, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !366, line: 72, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !366, line: 14, baseType: !92)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !602, line: 26, size: 128, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !612, file: !602, line: 27, baseType: !317, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !612, file: !602, line: 28, baseType: !359, size: 16, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !601, file: !602, line: 126, baseType: !617, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!608, !551, !611, !317, !620}
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 54, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !366, line: 71, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !366, line: 15, baseType: !82)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !601, file: !602, line: 127, baseType: !624, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!627, !551, !629}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !592, file: !546, line: 111, baseType: !632, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !592, file: !546, line: 112, baseType: !634, size: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!637, !551}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !13, line: 40, size: 320, elements: !640)
!640 = !{!641, !642, !646, !652, !656}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !639, file: !13, line: 41, baseType: !12, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !639, file: !13, line: 42, baseType: !643, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!73}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !639, file: !13, line: 43, baseType: !647, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!627, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !13, line: 20, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !639, file: !13, line: 44, baseType: !653, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!627}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !639, file: !13, line: 45, baseType: !657, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !73}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !592, file: !546, line: 113, baseType: !661, size: 64, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!627, !551}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !545, file: !546, line: 66, baseType: !665, size: 64, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_dirent", file: !602, line: 130, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "kref", scope: !545, file: !546, line: 67, baseType: !668, size: 32, offset: 448)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !669, line: 24, size: 32, elements: !670)
!669 = !DIFile(filename: "include/linux/kref.h", directory: "/data/android/android-7.0/kernel/msm")
!670 = !{!671}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !668, file: !669, line: 25, baseType: !95, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "state_initialized", scope: !545, file: !546, line: 68, baseType: !76, size: 1, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_sysfs", scope: !545, file: !546, line: 69, baseType: !76, size: 1, offset: 481, flags: DIFlagBitField, extraData: i64 480)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "state_add_uevent_sent", scope: !545, file: !546, line: 70, baseType: !76, size: 1, offset: 482, flags: DIFlagBitField, extraData: i64 480)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "state_remove_uevent_sent", scope: !545, file: !546, line: 71, baseType: !76, size: 1, offset: 483, flags: DIFlagBitField, extraData: i64 480)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_suppress", scope: !545, file: !546, line: 72, baseType: !76, size: 1, offset: 484, flags: DIFlagBitField, extraData: i64 480)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !542, file: !6, line: 42, baseType: !532, size: 64, offset: 512)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "drivers_dir", scope: !542, file: !6, line: 43, baseType: !551, size: 64, offset: 576)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mp", scope: !542, file: !6, line: 44, baseType: !680, size: 64, offset: 640)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_param_attrs", file: !6, line: 44, flags: DIFlagFwdDecl)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "modinfo_attrs", scope: !533, file: !6, line: 235, baseType: !683, size: 64, offset: 1344)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_attribute", file: !6, line: 47, size: 448, elements: !685)
!685 = !{!686, !687, !692, !696, !700, !704}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !684, file: !6, line: 48, baseType: !612, size: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !684, file: !6, line: 49, baseType: !688, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!608, !683, !691, !476}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !684, file: !6, line: 51, baseType: !693, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!608, !683, !691, !317, !620}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !684, file: !6, line: 53, baseType: !697, size: 64, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !532, !317}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !684, file: !6, line: 54, baseType: !701, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!99, !532}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !684, file: !6, line: 55, baseType: !705, size: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !532}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !533, file: !6, line: 236, baseType: !317, size: 64, offset: 1408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "srcversion", scope: !533, file: !6, line: 237, baseType: !317, size: 64, offset: 1472)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "holders_dir", scope: !533, file: !6, line: 238, baseType: !551, size: 64, offset: 1536)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "syms", scope: !533, file: !6, line: 241, baseType: !712, size: 64, offset: 1600)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_symbol", file: !715, line: 26, size: 128, elements: !716)
!715 = !DIFile(filename: "include/linux/export.h", directory: "/data/android/android-7.0/kernel/msm")
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !714, file: !715, line: 28, baseType: !82, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !714, file: !715, line: 29, baseType: !317, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "crcs", scope: !533, file: !6, line: 242, baseType: !720, size: 64, offset: 1664)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "num_syms", scope: !533, file: !6, line: 243, baseType: !76, size: 32, offset: 1728)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "kp", scope: !533, file: !6, line: 246, baseType: !724, size: 64, offset: 1792)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !726, line: 48, size: 256, elements: !727)
!726 = !DIFile(filename: "include/linux/moduleparam.h", directory: "/data/android/android-7.0/kernel/msm")
!727 = !{!728, !729, !745, !746, !749}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !725, file: !726, line: 49, baseType: !317, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !725, file: !726, line: 50, baseType: !730, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !726, line: 39, size: 192, elements: !733)
!733 = !{!734, !740, !744}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !732, file: !726, line: 41, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!99, !317, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !732, file: !726, line: 43, baseType: !741, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!99, !476, !738}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !732, file: !726, line: 45, baseType: !657, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !725, file: !726, line: 51, baseType: !263, size: 16, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !725, file: !726, line: 52, baseType: !747, size: 16, offset: 144)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !143, line: 18, baseType: !748)
!748 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!749 = !DIDerivedType(tag: DW_TAG_member, scope: !725, file: !726, line: 53, baseType: !750, size: 64, offset: 192)
!750 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !725, file: !726, line: 53, size: 64, elements: !751)
!751 = !{!752, !753, !760}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !750, file: !726, line: 54, baseType: !73, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !750, file: !726, line: 55, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !726, line: 61, size: 128, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !756, file: !726, line: 62, baseType: !76, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !756, file: !726, line: 63, baseType: !476, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !750, file: !726, line: 56, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !726, line: 67, size: 256, elements: !764)
!764 = !{!765, !766, !767, !769, !770}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !763, file: !726, line: 69, baseType: !76, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !763, file: !726, line: 70, baseType: !76, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !763, file: !726, line: 71, baseType: !768, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !763, file: !726, line: 72, baseType: !730, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !763, file: !726, line: 73, baseType: !73, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "num_kp", scope: !533, file: !6, line: 247, baseType: !76, size: 32, offset: 1856)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "num_gpl_syms", scope: !533, file: !6, line: 250, baseType: !76, size: 32, offset: 1888)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_syms", scope: !533, file: !6, line: 251, baseType: !712, size: 64, offset: 1920)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_crcs", scope: !533, file: !6, line: 252, baseType: !720, size: 64, offset: 1984)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_future_syms", scope: !533, file: !6, line: 272, baseType: !712, size: 64, offset: 2048)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_future_crcs", scope: !533, file: !6, line: 273, baseType: !720, size: 64, offset: 2112)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "num_gpl_future_syms", scope: !533, file: !6, line: 274, baseType: !76, size: 32, offset: 2176)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "num_exentries", scope: !533, file: !6, line: 277, baseType: !76, size: 32, offset: 2208)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "extable", scope: !533, file: !6, line: 278, baseType: !780, size: 64, offset: 2240)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exception_table_entry", file: !782, line: 48, size: 128, elements: !783)
!782 = !DIFile(filename: "/data/android/android-7.0/kernel/msm/arch/arm64/include/asm/uaccess.h", directory: "/data/android/android-7.0/kernel/msm")
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "insn", scope: !781, file: !782, line: 50, baseType: !82, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fixup", scope: !781, file: !782, line: 50, baseType: !82, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !533, file: !6, line: 281, baseType: !787, size: 64, offset: 2304)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!99}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "module_init", scope: !533, file: !6, line: 284, baseType: !73, size: 64, offset: 2368)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "module_core", scope: !533, file: !6, line: 287, baseType: !73, size: 64, offset: 2432)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "init_size", scope: !533, file: !6, line: 290, baseType: !76, size: 32, offset: 2496)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "core_size", scope: !533, file: !6, line: 290, baseType: !76, size: 32, offset: 2528)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "init_text_size", scope: !533, file: !6, line: 293, baseType: !76, size: 32, offset: 2560)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "core_text_size", scope: !533, file: !6, line: 293, baseType: !76, size: 32, offset: 2592)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "init_ro_size", scope: !533, file: !6, line: 296, baseType: !76, size: 32, offset: 2624)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "core_ro_size", scope: !533, file: !6, line: 296, baseType: !76, size: 32, offset: 2656)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !533, file: !6, line: 299, baseType: !799, offset: 2688)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mod_arch_specific", file: !800, line: 9, elements: !801)
!800 = !DIFile(filename: "include/asm-generic/module.h", directory: "/data/android/android-7.0/kernel/msm")
!801 = !{}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "taints", scope: !533, file: !6, line: 301, baseType: !76, size: 32, offset: 2688)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "num_bugs", scope: !533, file: !6, line: 305, baseType: !76, size: 32, offset: 2720)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bug_list", scope: !533, file: !6, line: 306, baseType: !135, size: 128, offset: 2752)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bug_table", scope: !533, file: !6, line: 307, baseType: !806, size: 64, offset: 2880)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bug_entry", file: !808, line: 18, size: 192, elements: !809)
!808 = !DIFile(filename: "include/asm-generic/bug.h", directory: "/data/android/android-7.0/kernel/msm")
!809 = !{!810, !811, !812, !813}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "bug_addr", scope: !807, file: !808, line: 20, baseType: !82, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !807, file: !808, line: 26, baseType: !317, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !807, file: !808, line: 30, baseType: !264, size: 16, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !807, file: !808, line: 32, baseType: !264, size: 16, offset: 144)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !533, file: !6, line: 316, baseType: !815, size: 64, offset: 2944)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Sym", file: !817, line: 198, baseType: !818)
!817 = !DIFile(filename: "include/uapi/linux/elf.h", directory: "/data/android/android-7.0/kernel/msm")
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elf64_sym", file: !817, line: 191, size: 192, elements: !819)
!819 = !{!820, !822, !823, !824, !827, !830}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "st_name", scope: !818, file: !817, line: 192, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Word", file: !817, line: 20, baseType: !510)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "st_info", scope: !818, file: !817, line: 193, baseType: !227, size: 8, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "st_other", scope: !818, file: !817, line: 194, baseType: !227, size: 8, offset: 40)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "st_shndx", scope: !818, file: !817, line: 195, baseType: !825, size: 16, offset: 48)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Half", file: !817, line: 16, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !511, line: 23, baseType: !264)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "st_value", scope: !818, file: !817, line: 196, baseType: !828, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Addr", file: !817, line: 15, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !511, line: 30, baseType: !144)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !818, file: !817, line: 197, baseType: !831, size: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Xword", file: !817, line: 21, baseType: !829)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "core_symtab", scope: !533, file: !6, line: 316, baseType: !815, size: 64, offset: 3008)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "num_symtab", scope: !533, file: !6, line: 317, baseType: !76, size: 32, offset: 3072)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "core_num_syms", scope: !533, file: !6, line: 317, baseType: !76, size: 32, offset: 3104)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "strtab", scope: !533, file: !6, line: 318, baseType: !476, size: 64, offset: 3136)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "core_strtab", scope: !533, file: !6, line: 318, baseType: !476, size: 64, offset: 3200)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "sect_attrs", scope: !533, file: !6, line: 321, baseType: !838, size: 64, offset: 3264)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_sect_attrs", file: !6, line: 321, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "notes_attrs", scope: !533, file: !6, line: 324, baseType: !841, size: 64, offset: 3328)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_notes_attrs", file: !6, line: 324, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !533, file: !6, line: 329, baseType: !476, size: 64, offset: 3392)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "percpu", scope: !533, file: !6, line: 333, baseType: !73, size: 64, offset: 3456)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "percpu_size", scope: !533, file: !6, line: 334, baseType: !76, size: 32, offset: 3520)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "num_tracepoints", scope: !533, file: !6, line: 338, baseType: !76, size: 32, offset: 3552)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tracepoints_ptrs", scope: !533, file: !6, line: 339, baseType: !848, size: 64, offset: 3584)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tracepoint", file: !852, line: 30, size: 320, elements: !853)
!852 = !DIFile(filename: "include/linux/tracepoint.h", directory: "/data/android/android-7.0/kernel/msm")
!853 = !{!854, !855, !860, !864, !865}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !851, file: !852, line: 31, baseType: !317, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !851, file: !852, line: 32, baseType: !856, size: 32, offset: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "static_key", file: !857, line: 136, size: 32, elements: !858)
!857 = !DIFile(filename: "include/linux/jump_label.h", directory: "/data/android/android-7.0/kernel/msm")
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !856, file: !857, line: 137, baseType: !95, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "regfunc", scope: !851, file: !852, line: 33, baseType: !861, size: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{null}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "unregfunc", scope: !851, file: !852, line: 34, baseType: !861, size: 64, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !851, file: !852, line: 35, baseType: !866, size: 64, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tracepoint_func", file: !852, line: 25, size: 128, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !867, file: !852, line: 26, baseType: !73, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !867, file: !852, line: 27, baseType: !73, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "num_trace_bprintk_fmt", scope: !533, file: !6, line: 346, baseType: !76, size: 32, offset: 3648)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "trace_bprintk_fmt_start", scope: !533, file: !6, line: 347, baseType: !873, size: 64, offset: 3712)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "trace_events", scope: !533, file: !6, line: 350, baseType: !875, size: 64, offset: 3776)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "ftrace_event_call", file: !6, line: 350, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "num_trace_events", scope: !533, file: !6, line: 351, baseType: !76, size: 32, offset: 3840)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !519, file: !352, line: 1848, baseType: !518, size: 64, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !519, file: !352, line: 1849, baseType: !881, size: 64, offset: 384)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !75, line: 189, size: 64, elements: !882)
!882 = !{!883}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !881, file: !75, line: 190, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !75, line: 193, size: 128, elements: !886)
!886 = !{!887, !888}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !885, file: !75, line: 194, baseType: !884, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !885, file: !75, line: 194, baseType: !889, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !519, file: !352, line: 1851, baseType: !891, offset: 448)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !892, line: 411, elements: !801)
!892 = !DIFile(filename: "include/linux/lockdep.h", directory: "/data/android/android-7.0/kernel/msm")
!893 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !519, file: !352, line: 1852, baseType: !891, offset: 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !519, file: !352, line: 1853, baseType: !891, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !519, file: !352, line: 1854, baseType: !896, offset: 448)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 3)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !519, file: !352, line: 1856, baseType: !891, offset: 448)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !519, file: !352, line: 1857, baseType: !891, offset: 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !519, file: !352, line: 1858, baseType: !891, offset: 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !504, file: !352, line: 1255, baseType: !903, size: 64, offset: 384)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !352, line: 1623, size: 1280, elements: !906)
!906 = !{!907, !911, !915, !919, !925, !929, !930, !931, !935, !939, !940, !946, !951, !952, !1001, !1002, !1003, !1004, !1008, !1009}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !905, file: !352, line: 1624, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!355, !503}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !905, file: !352, line: 1625, baseType: !912, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{null, !355}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !905, file: !352, line: 1627, baseType: !916, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !355, !99}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !905, file: !352, line: 1628, baseType: !920, size: 64, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!99, !355, !923}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !327, line: 30, flags: DIFlagFwdDecl)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !905, file: !352, line: 1629, baseType: !926, size: 64, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!99, !355}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !905, file: !352, line: 1630, baseType: !912, size: 64, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !905, file: !352, line: 1631, baseType: !528, size: 64, offset: 384)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !905, file: !352, line: 1632, baseType: !932, size: 64, offset: 448)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!99, !503, !99}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !905, file: !352, line: 1633, baseType: !936, size: 64, offset: 512)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!99, !503}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !905, file: !352, line: 1634, baseType: !936, size: 64, offset: 576)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !905, file: !352, line: 1635, baseType: !941, size: 64, offset: 640)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!99, !385, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !352, line: 42, flags: DIFlagFwdDecl)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !905, file: !352, line: 1636, baseType: !947, size: 64, offset: 704)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!99, !503, !950, !476}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !905, file: !352, line: 1637, baseType: !528, size: 64, offset: 768)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !905, file: !352, line: 1639, baseType: !953, size: 64, offset: 832)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!99, !956, !385}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !958, line: 18, size: 1024, elements: !959)
!958 = !DIFile(filename: "include/linux/seq_file.h", directory: "/data/android/android-7.0/kernel/msm")
!959 = !{!960, !961, !962, !963, !964, !965, !966, !967, !968, !977, !999, !1000}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !957, file: !958, line: 19, baseType: !476, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !957, file: !958, line: 20, baseType: !620, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !957, file: !958, line: 21, baseType: !620, size: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !957, file: !958, line: 22, baseType: !620, size: 64, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pad_until", scope: !957, file: !958, line: 23, baseType: !620, size: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !957, file: !958, line: 24, baseType: !515, size: 64, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !957, file: !958, line: 25, baseType: !515, size: 64, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !957, file: !958, line: 26, baseType: !142, size: 64, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !957, file: !958, line: 27, baseType: !969, size: 320, offset: 512)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !970, line: 48, size: 320, elements: !971)
!970 = !DIFile(filename: "include/linux/mutex.h", directory: "/data/android/android-7.0/kernel/msm")
!971 = !{!972, !973, !974, !975, !976}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !969, file: !970, line: 50, baseType: !95, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !969, file: !970, line: 51, baseType: !427, size: 32, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !969, file: !970, line: 52, baseType: !135, size: 128, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !969, file: !970, line: 54, baseType: !86, size: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "spin_mlock", scope: !969, file: !970, line: 57, baseType: !73, size: 64, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !957, file: !958, line: 28, baseType: !978, size: 64, offset: 832)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_operations", file: !958, line: 36, size: 256, elements: !981)
!981 = !{!982, !987, !991, !995}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !980, file: !958, line: 37, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!73, !956, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !980, file: !958, line: 38, baseType: !988, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{null, !956, !73}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !980, file: !958, line: 39, baseType: !992, size: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!73, !956, !73, !986}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !980, file: !958, line: 40, baseType: !996, size: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!99, !956, !73}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !957, file: !958, line: 29, baseType: !99, size: 32, offset: 896)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !957, file: !958, line: 33, baseType: !73, size: 64, offset: 960)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !905, file: !352, line: 1640, baseType: !953, size: 64, offset: 896)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !905, file: !352, line: 1641, baseType: !953, size: 64, offset: 960)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !905, file: !352, line: 1642, baseType: !953, size: 64, offset: 1024)
